<?php

//////////////////////////////////////////////////////////////////////////////////////////////////////
//                                             TRAVIANZ                                             //
//            Only for advanced users, do not edit if you dont know what are you doing!             //
//                                Made by: Dzoki & Dixie (TravianZ)                                 //
//                              - TravianZ = Travian Clone Project -                                //
//                                 DO NOT REMOVE COPYRIGHT NOTICE!                                  //
//                                Adding tasks, constructions and artefact  by: Armando             //
//                                Modified , added , fixed , implementd  by: Shadow and ronix       //
//////////////////////////////////////////////////////////////////////////////////////////////////////
									//                         //
									//         ENGLISH         //
									//      Author: Dzoki      //
									//     Adding: Armando     //
									/////////////////////////////

//MAIN MENU
define("TRIBE1","الرومان");
define("TRIBE2","الجرمان");
define("TRIBE3","الإغريق");
define("TRIBE4","الطبيعة");
define("TRIBE5","النتار");
define("TRIBE6","الوحوش");

define("HOME","الصفحة الرئيسية");
define("INSTRUCT","التعليمات");
define("ADMIN_PANEL","لوحة الإدارة");
define("MASS_MESSAGE","رسالة جماعية");
define("LOGOUT","تسجيل الخروج");
define("PROFILE","الملف الشخصي");
define("SUPPORT","الدعم");
define("UPDATE_T_10","تحديث أفضل 10");
define("SYSTEM_MESSAGE","رسالة النظام");
define("TRAVIAN_PLUS","ترافيان <b><span class=\"plus_g\">ب</span><span class=\"plus_o\">ل</span><span class=\"plus_g\">س</span></span></b>");
define("CONTACT","اتصل بنا!");
define("GAME_RULES","قواعد اللعبة");

//MENU
define("REG","التسجيل");
define("FORUM","المنتدى");
define("CHAT","الدردشة");
define("IMPRINT","البصمة");
define("MORE_LINKS","روابط إضافية");
define("TOUR","جولة في اللعبة");


//ERRORS
define("USRNM_EMPTY","(اسم المستخدم فارغ)");
define("USRNM_TAKEN","(الاسم مستخدم بالفعل.)");
define("USRNM_SHORT","(الحد الأدنى ".USRNM_MIN_LENGTH." من الأحرف)");
define("USRNM_CHAR","(أحرف غير صالحة)");
define("PW_EMPTY","(كلمة المرور فارغة)");
define("PW_SHORT","(الحد الأدنى ".PW_MIN_LENGTH." من الأحرف)");
define("PW_INSECURE","(كلمة المرور غير آمنة. يرجى اختيار كلمة مرور أكثر أمانًا.)");
define("EMAIL_EMPTY","(البريد الإلكتروني فارغ)");
define("EMAIL_INVALID","(عنوان بريد إلكتروني غير صالح)");
define("EMAIL_TAKEN","(البريد الإلكتروني مستخدم بالفعل)");
define("TRIBE_EMPTY","<li>يرجى اختيار قبيلة.</li>");
define("AGREE_ERROR","<li>يجب الموافقة على قواعد اللعبة والشروط والأحكام العامة للتسجيل.</li>");
define("LOGIN_USR_EMPTY","أدخل الاسم.");
define("LOGIN_PASS_EMPTY","أدخل كلمة المرور.");
define("EMAIL_ERROR","البريد الإلكتروني لا يتطابق مع الموجود");
define("PASS_MISMATCH","كلمات المرور غير متطابقة");
define("ALLI_OWNER","يرجى تعيين مالك التحالف قبل الحذفing");
define("SIT_ERROR","الحارس مضبوط بالفعل أو اللاعب غير موجود");
define("USR_NT_FOUND","الاسم غير موجود.");
define("LOGIN_PW_ERROR","كلمة المرور غير صحيحة.");
define("WEL_TOPIC","نصائح ومعلومات مفيدة");
define("ATAG_EMPTY","الوسم فارغ");
define("ANAME_EMPTY","الاسم فارغ");
define("ATAG_EXIST","الوسم مأخوذ");
define("ANAME_EXIST","الاسم مأخوذ");
define("ALREADY_ALLY_MEMBER","أنت بالفعل في تحالف");
define("ALLY_TOO_LOW", "يجب أن يكون لديك سفارة من المستوى 3 أو أعلى");
define("USER_NOT_IN_YOUR_ALLY","هذا المستخدم ليس في تحالفك!");
define("CANT_EDIT_YOUR_PERMISSIONS","لا يمكنك تعديل أذوناتك الخاصة!");
define("CANT_EDIT_LEADER_PERMISSIONS","لا يمكن تعديل أذونات قائد التحالف!");
define("NO_PERMISSION", "ليس لديك الأذونات الكافية!");
define("NAME_OR_DIPL_EMPTY", "الاسم أو الدبلوماسية فارغ");
define("ALLY_DOESNT_EXISTS","التحالف غير موجود");
define("CANNOT_INVITE_SAME_ALLY","لا يمكنك دعوة تحالفك الخاص");
define("WRONG_DIPLOMACY","تم اتخاذ خيار خاطئ");
define("INVITE_ALREADY_SENT","إما أنك أرسلت دعوة مسبقًا لهذا التحالف، أو أنهم أرسلوها لتحالفك، أو لديك اتفاقية معهم بالفعل");
define("INVITE_SENT","تم إرسال الدعوة");
define("DECLARED_WAR_ON","أعلن الحرب على");
define("OFFERED_NON_AGGRESION_PACT_TO","قدم اتفاقية عدم اعتداء إلى");
define("OFFERED_CONFED_TO","قدم اتحادًا إلى");
define("ALLY_TOO_MUCH_PACTS","إما أنك لا تستطيع تقديم المزيد من الاتفاقيات من هذا النوع أو أن التحالف الآخر قد وصل إلى الحد المسموح به لهذا النوع");
define("ALLY_PERMISSIONS_UPDATED","تم تحديث الأذونات");
define("ALLY_FORUM_LINK_UPDATED", "تم تحديث رابط المنتدى");
define("NO_FORUMS_YET","لا توجد منتديات حتى الآن.");
define("ALLY_USER_KICKED"," تم طرده من التحالف");
define("NOT_OPENED_YET","الخادم لم يبدأ بعد.");
define("REGISTER_CLOSED","التسجيل مغلق. لا يمكنك التسجيل في هذا الخادم.");
define("NAME_EMPTY","يرجى إدخال الاسم");
define("NAME_NO_EXIST","لا يوجد مستخدم بهذا الاسم ");
define("ID_NO_EXIST","لا يوجد مستخدم بهذا الرقم ");
define("SAME_NAME","لا يمكنك دعوة نفسك");
define("ALREADY_INVITED"," تمت دعوته بالفعل");
define("ALREADY_IN_ALLY"," موجود بالفعل في هذا التحالف");
define("ALREADY_IN_AN_ALLY"," موجود بالفعل في تحالف");
define("NAME_OR_TAG_CHANGED","تم تغيير الاسم أو الوسم");
define("VAC_MODE_WRONG_DAYS","لقد أدخلت عدد أيام غير صحيح");


//COPYRIGHT
define("TRAVIAN_COPYRIGHT","TravianZ نسخة مفتوحة المصدر 100% من لعبة Travian.");


//BUILD.TPL
define("CUR_PROD","الإنتاج الحالي");
define("NEXT_PROD","الإنتاج عند المستوى ");

//BUILDINGS
define("B1","حطّاب");
define("B1_DESC","يقوم الحطّاب بقطع الأشجار لإنتاج الأخشاب. كلما طورت الحطّاب زاد إنتاجه من الأخشاب.");
define("B2","حفرة الطين");
define("B2_DESC","يتم إنتاج الطين هنا. بزيادة مستواها يمكنك زيادة إنتاج الطين.");
define("B3","منجم الحديد");
define("B3_DESC","يقوم العمال هنا بإنتاج مورد الحديد الثمين. بزيادة مستوى المنجم يزداد إنتاج الحديد.");
define("B4","حقول القمح");
define("B4_DESC","يتم إنتاج غذاء سكانك هنا. بزيادة مستوى الحقل يمكنك زيادة إنتاج القمح.");

//DORF1
define("LUMBER","الأخشاب");
define("CLAY","الطين");
define("IRON","الحديد");
define("CROP","القمح");
define("LEVEL","المستوى");
define("CROP_COM",CROP." المستهلك");
define("PER_HR","لكل ساعة");
define("PROD_HEADER","الإنتاج");
define("MULTI_V_HEADER","القرى");
define("ANNOUNCEMENT","إعلان");
define("GO2MY_VILLAGE","اذهب إلى قريتي");
define("VILLAGE_CENTER","مركز القرية");
define("FINISH_GOLD","إنهاء جميع أوامر البناء والبحث في هذه القرية فوراً مقابل 2 ذهب؟");
define("WAITING_LOOP","(انتظار في الطابور)");
define("CROP_NEGATIVE","إنتاج القمح لديك سلبي، لن تتمكن من الوصول إلى الكمية المطلوبة من الموارد.");
define("HRS","(ساعات)");
define("DONE_AT","ينتهي عند");
define("CANCEL","إلغاء");
define("LOYALTY","الولاء");
define("CALCULATED_IN","محسوب خلال");
define("SEVER_TIME","وقت الخادم:");
define("مرحباً","مرحباً");


//QUEST
define("Q_CONTINUE","تابع إلى المهمة التالية.");
define("Q_REWARD","مكافأتك:");
define("Q_BUTN","إكمال المهمة");
define("Q0","مرحباً بك في ");
define("Q0_DESC","كما أرى، لقد تم تعيينك زعيماً لهذه القرية الصغيرة. سأكون مستشارك خلال الأيام الأولى ولن أترك جانبك (اليد اليمنى).");
define("Q0_OPT1","إلى المهمة الأولى.");
define("Q0_OPT2","استكشف بنفسك.");
define("Q0_OPT3","لا تلعب أي مهام.");

define("Q1","المهمة 1: الحطّاب");
define("Q1_DESC","هناك أربع غابات خضراء حول قريتك. قم ببناء حطّاب على واحدة منها. الأخشاب مورد مهم لمستوطنتنا الجديدة.");
define("Q1_ORDER","التعليمات:<\/p>قم ببناء حطّاب.");
define("Q1_RESP","نعم، بهذه الطريقة تحصل على المزيد من الأخشاب. لقد ساعدت قليلاً وأكملت الطلب فوراً.");
define("Q1_REWARD","تم إكمال الحطّاب فوراً.");

define("Q2","المهمة 2: الحقول");
define("Q2_DESC","الآن رعاياك جائعون بعد العمل طوال اليوم. قم بزيادة مستوى أحد حقول القمح لتحسين إمدادات رعاياك. عد هنا بمجرد اكتمال البناء.");
define("Q2_ORDER","التعليمات:<\/p>قم بزيادة مستوى أحد حقول القمح.");
define("Q2_RESP","جيد جداً. الآن رعاياك لديهم ما يكفي من الطعام...");
define("Q2_REWARD","مكافأتك:<\/p>يوم واحد Travian");

define("Q3","المهمة 3: اسم قريتك");
define("Q3_DESC","بإبداعك يمكنك منح قريتك الاسم المثالي.<br \/><br \/>اضغط على 'الملف الشخصي' في القائمة اليسرى ثم اختر 'تغيير الملف الشخصي'...");
define("Q3_ORDER","التعليمات:<\/p>قم بتغيير اسم قريتك إلى اسم جميل.");
define("Q3_RESP","واو، اسم رائع لقريتهم. كان يمكن أن يكون اسم قريتي!...");

define("Q4","المهمة 4: لاعبين آخرين");
define("Q4_DESC","في ". SERVER_NAME ." تلعب مع مليارات من اللاعبين الآخرين. اضغط على 'الإحصائيات' في القائمة العلوية للبحث عن ترتيبك وأدخله هنا.");
define("Q4_ORDER","التعليمات:<\/p>ابحث عن ترتيبك في الإحصائيات وأدخله هنا.");
define("Q4_BUTN","إكمال المهمة");
define("Q4_RESP","بالضبط! هذا هو ترتيبك.");

define("Q5","المهمة 5: أمران للبناء");
define("Q5_DESC","قم ببناء منجم حديد وحفرة طين. لا يمكن أبداً أن يكون لديك ما يكفي من الحديد والطين.");
define("Q5_ORDER","التعليمات:<\/p><ul><li>قم بزيادة مستوى منجم حديد.<\/li><li>قم بزيادة مستوى حفرة طين.<\/li><\/ul>");
define("Q5_RESP","كما لاحظت، أوامر البناء تستغرق وقتاً طويلاً. عالم ". SERVER_NAME ." سيستمر بالدوران حتى إذا كنت غير متصل. حتى بعد بضعة أشهر سيكون هناك الكثير لتكتشفه.<br \/><br \/>أفضل شيء تفعله هو التحقق من قريتك بين الحين والآخر وإعطاء رعاياك مهام جديدة.");

define("Q6","المهمة 6: الرسائل");
define("Q6_DESC","يمكنك التحدث مع لاعبين آخرين باستخدام نظام الرسائل. أرسلت لك رسالة. اقرأها وعد هنا.<br \/><br \/>ملاحظة: لا تنسَ، في اليسار التقارير، وفي اليمين الرسائل.");
define("Q6_ORDER","التعليمات:<\/p>اقرأ رسالتك الجديدة.");
define("Q6_RESP","هل استلمتها؟ جيد جداً.<br \/><br \/>إليك بعض الذهب. مع الذهب يمكنك القيام بالعديد من الأمور، مثل زيادة إنتاج الموارد لديك. للقيام بذلك اضغط على ");
define("Q6_RESP1","الحساب في القائمة اليسرى.");
define("Q6_RESP2","في القائمة اليسرى.");
define("Q6_SUBJECT","رسالة من مدير المهام");
define("Q6_MESSAGE","يجب إعلامك بأن مكافأة جميلة بانتظارك عند مدير المهام.<br /><br />تلميح: الرسالة تم إنشاؤها تلقائياً. ليس من الضروري الرد.");

define("Q7","المهمة 7: واحدة لكل مورد!");
define("Q7_DESC","الآن يجب أن نزيد إنتاج الموارد قليلاً. قم ببناء حطّاب إضافي، حفرة طين، منجم حديد وحقل قمح إلى المستوى 1.");
define("Q7_ORDER","التعليمات:<\/p>قم بزيادة مستوى كل نوع من الموارد إلى المستوى 1.");
define("Q7_RESP","جيد جداً، إنتاج الموارد يتحسن بشكل رائع.");

define("Q8","المهمة 8: جيش ضخم!");
define("Q8_DESC","الآن لدي مهمة خاصة جداً لك. أنا جائع. أعطني 200 وحدة قمح!<br \/><br \/>مقابل ذلك، سأحاول تنظيم جيش ضخم لحماية قريتك.");
define("Q8_ORDER","التعليمات:<\/p>أرسل 200 وحدة قمح إلى مدير المهام.");
define("Q8_BUTN","إرسال القمح");
define("Q8_NOCROP","لا يوجد قمح كافٍ!");

define("Q9","المهمة 9: كل شيء إلى 1.");
define("Q9_DESC","في Travian هناك دائماً شيء لتفعله! بينما تنتظر وصول الجيش الضخم، لنزيد إنتاج الموارد قليلاً. قم بزيادة مستوى كل مواردك إلى المستوى 1.");
define("Q9_ORDER","التعليمات:<\/p>قم بزيادة مستوى جميع مواردك إلى المستوى 1.");
define("Q9_RESP","جيد جداً، إنتاج مواردك يتطور بشكل مزدهر.<br \/><br \/>قريباً يمكننا البدء ببناء المباني داخل القرية.");

define("Q10","المهمة 10: حمامة السلام");
define("Q10_DESC","الأيام الأولى بعد التسجيل تحظى بحماية ضد الهجمات من اللاعبين الآخرين. يمكنك معرفة مدة هذه الحماية عن طريق إضافة الكود <b>[#0]<\/b> إلى ملفك الشخصي.");
define("Q10_ORDER","التعليمات:<\/p>قم بكتابة الكود <b>[#0]<\/b> في ملفك الشخصي بإضافته إلى أحد حقول الوصف.");
define("Q10_RESP","أحسنت! الآن يمكن للجميع أن يروا أي محارب عظيم يقترب منهم.");
define("Q10_REWARD","مكافأتك:<\/p>يومان من Travian");

define("Q11","المهمة 11: الجيران!");
define("Q11_DESC","حولك توجد العديد من القرى المختلفة. واحدة منها اسمها ");
define("Q11_DESC1"," اضغط على 'الخريطة' في قائمة الرأس وابحث عن تلك القرية. يمكنك رؤية أسماء قرى جيرانك بتحريك الفأرة فوقها.");
define("Q11_ORDER","التعليمات:</p>ابحث عن إحداثيات ");
define("Q11_ORDER1","وأدخلها هنا.");
define("Q11_RESP","بالضبط، هناك ");
define("Q11_RESP1"," القرية! العديد من الموارد تصل إلى هذه القرية. حسنًا، تقريبًا نفس العدد...");
define("Q11_BUTN","إكمال المهمة");

define("Q12","المهمة 12: المخزن السري");
define("Q12_DESC","حان الوقت لإنشاء مخزن سري. عالم <?php echo SERVER_NAME; ?> خطير.<br \/><br \/>العديد من اللاعبين يعيشون عن طريق سرقة موارد الآخرين. قم ببناء مخزن سري لإخفاء بعض مواردك عن الأعداء.");
define("Q12_ORDER","التعليمات:<\/p>قم ببناء مخزن سري.");
define("Q12_RESP","أحسنت، الآن أصبح من الصعب على اللاعبين الآخرين نهب قريتك.<br \/><br \/>في حالة الهجوم، سيقوم القرويون بإخفاء الموارد في المخزن السري تلقائياً.");

define("Q13","المهمة 13: إلى المستوى 2.");
define("Q13_DESC","في <?php echo SERVER_NAME; ?> هناك دائماً شيء لتفعله! قم بزيادة مستوى الحطّاب، حفرة الطين، منجم الحديد وحقل القمح إلى المستوى 2.");
define("Q13_ORDER","التعليمات:<\/p>قم بزيادة مستوى كل نوع من الموارد إلى المستوى 2.");
define("Q13_RESP","جيد جداً، قريتك تنمو وتزدهر!");

define("Q14","المهمة 14: التعليمات");
define("Q14_DESC","في التعليمات داخل اللعبة يمكنك العثور على نصوص قصيرة حول المباني وأنواع الوحدات المختلفة.<br \/><br \/>اضغط على 'التعليمات' في اليسار لتعرف كم تحتاج الثكنات من الأخشاب.");
define("Q14_ORDER","التعليمات:<\/p>أدخل كمية الأخشاب التي تحتاجها الثكنات.");
define("Q14_BUTN","إكمال المهمة");
define("Q14_RESP","بالضبط! الثكنات تكلف 210 وحدة أخشاب.");


define("Q15","المهمة 15: المبنى الرئيسي");
define("Q15_DESC","يحتاج عمالك المهرة إلى مبنى رئيسي من المستوى 3 لتشييد مبانٍ هامة مثل السوق أو الثكنات.");
define("Q15_ORDER","التعليمات:<\/p>قم بزيادة مستوى المبنى الرئيسي إلى المستوى 3.");
define("Q15_RESP","أحسنت! تم إكمال المبنى الرئيسي إلى المستوى 3.<br><br>مع هذا الترقية، يمكن لعمالك المهرة بناء أنواع جديدة من المباني بالإضافة إلى العمل بسرعة أكبر.");

define("Q16","المهمة 16: تقدم!");
define("Q16_DESC","ابحث عن ترتيبك في إحصائيات اللاعبين مرة أخرى واستمتع بتقدمك.");
define("Q16_ORDER","التعليمات:<\/p>ابحث عن ترتيبك في الإحصائيات وأدخله هنا.");
define("Q16_RESP","أحسنت! هذا هو ترتيبك الحالي.");

define("Q17","المهمة 17: أسلحة أم تجارة");
define("Q17_DESC","الآن عليك اتخاذ قرار: إما أن تتاجر بسلام أو تصبح محاربًا مرهوب الجانب.<br \/><br \/>للسوق تحتاج إلى مخزن حبوب، وللثكنات تحتاج إلى نقطة تجمع.");
define("Q17_BUTN","اقتصاد");
define("Q17_BUTN1","عسكري");

define("Q18","المهمة 18: عسكري");
define("Q18_DESC","قرار شجاع. لتتمكن من إرسال القوات تحتاج إلى نقطة تجمع.<br \/><br \/>يجب بناء نقطة التجمع على موقع بناء محدد. موقع البناء ");
define("Q18_DESC1",".");
define("Q18_DESC2"," يقع على الجانب الأيمن من المبنى الرئيسي، أسفل قليلاً. الموقع نفسه منحني.");
define("Q18_ORDER","التعليمات:<\/p>قم ببناء نقطة تجمع.");
define("Q18_RESP","تم بناء نقطة التجمع الخاصة بك! خطوة جيدة نحو السيطرة على العالم!");

define("Q19","المهمة 19: الثكنات");
define("Q19_DESC","الآن لديك مبنى رئيسي من المستوى 3 ونقطة تجمع. هذا يعني أن جميع المتطلبات اللازمة لبناء الثكنات قد تم تلبيتها.<br><br>يمكنك استخدام الثكنات لتدريب القوات للقتال.");
define("Q19_ORDER","التعليمات:<\/p>قم ببناء ثكنات.");
define("Q19_RESP","أحسنت! اجتمع أفضل المدربين من كل أنحاء البلاد لتطوير مهارات مقاتليك إلى أفضل صورة.");

define("Q20","المهمة 20: التدريب.");
define("Q20_DESC","الآن بعد أن أصبح لديك ثكنات، يمكنك بدء تدريب القوات. قم بتدريب جنديين ");
define("Q20_ORDER","يرجى تدريب 2 ");
define("Q20_RESP","تم وضع أساس جيشك المجيد.<br \/><br \/>قبل إرسال جيشك للنهب، يُفضل التحقق باستخدام.");
define("Q20_RESP1","محاكي المعركة");
define("Q20_RESP2","لترى عدد القوات اللازمة لقتال فأر واحد بنجاح دون خسائر.");


define("Q21","المهمة 21: الاقتصاد");
define("Q21_DESC","التجارة والاقتصاد كانا خيارك. أوقات ذهبية بانتظارك بالتأكيد!");
define("Q21_ORDER","التعليمات:<\/p>قم ببناء مخزن حبوب.");
define("Q21_RESP","أحسنت! مع مخزن الحبوب يمكنك تخزين المزيد من القمح.");

define("Q22","المهمة 22: المخزن");
define("Q22_DESC","ليس القمح فقط هو الذي يجب حفظه. الموارد الأخرى يمكن أن تضيع أيضًا إذا لم يتم تخزينها بشكل صحيح. قم ببناء مخزن!");
define("Q22_ORDER","التعليمات:<\/p>قم ببناء مخزن.");
define("Q22_RESP","أحسنت! تم إكمال المخزن...<br \/>الآن لقد استوفيت جميع المتطلبات اللازمة لبناء السوق.");

define("Q23","المهمة 23: السوق.");
define("Q23_DESC","قم ببناء سوق لتتمكن من التجارة مع اللاعبين الآخرين.");
define("Q23_ORDER","التعليمات:<\/p>يرجى بناء سوق.");
define("Q23_RESP","تم إكمال السوق. الآن يمكنك تقديم عروضك الخاصة وقبول العروض الخارجية! عند إنشاء عروضك الخاصة، يجب أن تفكر في تقديم ما يحتاجه اللاعبون الآخرون للحصول على المزيد من الأرباح.");

define("Q24","المهمة 24: كل شيء إلى 2.");
define("Q24_DESC","الآن يجب أن نزيد إنتاج الموارد قليلاً. قم بزيادة مستوى الحطّاب، حفرة الطين، منجم الحديد، وحقل القمح إلى المستوى 2.");
define("Q24_ORDER","التعليمات:<\/p>قم بزيادة مستوى جميع الموارد إلى المستوى 2.");
define("Q24_RESP","تهانينا! قريتك تنمو وتزدهر...");

define("Q28","المهمة 28: التحالف.");
define("Q28_DESC","التعاون مهم في لعبة Travian. اللاعبون الذين يعملون معًا ينظمون أنفسهم في تحالفات. احصل على دعوة من تحالف في منطقتك وانضم إليه. كبديل، يمكنك تأسيس تحالف خاص بك. للقيام بذلك، تحتاج إلى سفارة بمستوى 3.");
define("Q28_ORDER","التعليمات:<\/p>انضم إلى تحالف أو قم بتأسيس واحد بنفسك.");
define("Q28_RESP","جيد! الآن أنت في تحالف يُدعى");
define("Q28_RESP1","، وأنت عضو في تحالفهم مما سيساعدك على التقدم بشكل أسرع...");


define("Q29","المهمة 29: المبنى الرئيسي إلى المستوى 5");
define("Q29_DESC","لكي تتمكن من بناء قصر أو إقامة، ستحتاج إلى مبنى رئيسي في المستوى 5.");
define("Q29_ORDER","التعليمات:<\/p>قم بترقية المبنى الرئيسي إلى المستوى 5.");
define("Q29_RESP","المبنى الرئيسي الآن في المستوى 5، ويمكنك بناء قصر أو إقامة...");

define("Q30","المهمة 30: مخزن الحبوب إلى المستوى 3.");
define("Q30_DESC","حتى لا تفقد القمح، يجب عليك ترقية مخزن الحبوب.");
define("Q30_ORDER","التعليمات:<\/p>قم بترقية مخزن الحبوب إلى المستوى 3.");
define("Q30_RESP","مخزن الحبوب الآن في المستوى 3...");

define("Q31","المهمة 31: المخزن إلى المستوى 7");
define("Q31_DESC","للتأكد من أن مواردك لن تفيض، يجب عليك ترقية المخزن.");
define("Q31_ORDER","التعليمات:<\/p>قم بترقية المخزن إلى المستوى 7.");
define("Q31_RESP","تمت ترقية المخزن إلى المستوى 7...");

define("Q32","المهمة 32: الكل إلى المستوى 5!");
define("Q32_DESC","ستحتاج دائمًا إلى المزيد من الموارد. بلاطات الموارد باهظة الثمن ولكنها دائمًا تعود بفائدة على المدى الطويل.");
define("Q32_ORDER","التعليمات:<\/p>قم بترقية جميع بلاطات الموارد إلى المستوى 5.");
define("Q32_RESP","جميع الموارد الآن في المستوى 5. جيد جدًا، قريتك تنمو وتزدهر!");

define("Q33","المهمة 33: القصر أم الإقامة؟");
define("Q33_DESC","لكي تؤسس قرية جديدة، ستحتاج إلى مستوطنين. يمكنك تدريبهم في قصر أو إقامة.");
define("Q33_ORDER","التعليمات:<\/p>قم ببناء قصر أو إقامة إلى المستوى 10.");
define("Q33_RESP","تم الوصول إلى المستوى 10، يمكنك الآن تدريب المستوطنين وتأسيس قريتك الثانية. لاحظ النقاط الثقافية...");

define("Q34","المهمة 34: 3 مستوطنين.");
define("Q34_DESC","لتأسيس قرية جديدة، ستحتاج إلى مستوطنين. يمكن تدريبهم في قصر أو إقامة.");
define("Q34_ORDER","التعليمات:<\/p>قم بتدريب 3 مستوطنين.");
define("Q34_RESP","تم تدريب 3 مستوطنين. لتأسيس قرية جديدة تحتاج على الأقل إلى");
define("Q34_RESP1","نقاط ثقافية...");


define("Q35","المهمة 35: قرية جديدة.");
define("Q35_DESC","هناك العديد من البلاطات الفارغة على الخريطة. ابحث عن واحدة تناسبك وأسس قرية جديدة.");
define("Q35_ORDER","التعليمات:<\/p>قم بتأسيس قرية جديدة.");
define("Q35_RESP","أنا فخور بك! الآن لديك قريتان وجميع الإمكانيات لبناء إمبراطورية عظيمة. أتمنى لك التوفيق في ذلك.");

define("Q36","المهمة 36: بناء ");
define("Q36_DESC","الآن بعد أن قمت بتدريب بعض الجنود، يجب عليك بناء ");
define("Q36_DESC1"," أيضًا. هذا يزيد من الدفاع الأساسي ويحصل جنودك على مكافأة دفاعية.");
define("Q36_ORDER","التعليمات:<\/p>قم ببناء ");
define("Q36_RESP","هذا ما كنت أتحدث عنه. الـ ");
define("Q36_RESP1"," مفيد جدًا. يزيد من دفاع القوات في القرية.");

define("Q37","المهام");
define("Q37_DESC","تم تحقيق جميع المهام!");

define("OPT3","نظرة عامة على الموارد");
define("T","توصيلات مواردك");
define("T1","التوصيل");
define("T2","وقت التوصيل");
define("T3","الحالة");
define("T4","جلب");
define("T5","تم الجلب");
define("T6","في الانتظار");
define("T7","يوم واحد Travian ");
define("T8","يومان من Travian ");


//Quest 25
define("Q25_7","المهمة 7: الجيران!");
define("Q25_7_DESC","حولك، توجد العديد من القرى المختلفة. واحدة منها اسمها ");
define("Q25_7_DESC1","اضغط على 'الخريطة' في القائمة الرئيسية وابحث عن تلك القرية. يمكنك رؤية أسماء قرى جيرانك بمجرد تحريك الفأرة فوق أي منها.");
define("Q25_7_ORDER","<\/p><b>التعليمات:</b><br>ابحث عن إحداثيات ");
define("Q25_7_ORDER1","وأدخلها هنا.");
define("Q25_7_RESP","بالضبط، هناك ");
define("Q25_7_RESP1"," القرية! كما تصل العديد من الموارد إلى هذه القرية. حسنًا، تقريبًا مثل ذلك...");

define("Q25_8","المهمة 8: جيش ضخم!");
define("Q25_8_DESC","لدي الآن مهمة خاصة جدًا لك. أنا جائع. أعطني 200 وحدة قمح!<br \/><br \/>مقابل ذلك، سأحاول تنظيم جيش ضخم لحماية قريتك.");
define("Q25_8_ORDER","التعليمات:<\/p>أرسل 200 وحدة قمح إلى مدير المهام.");
define("Q25_8_BUTN","إرسال القمح");
define("Q25_8_NOCROP","لا يوجد قمح كافٍ!");

define("Q25_9","المهمة 9: واحدة لكل نوع!");
define("Q25_9_DESC","في " . SERVER_NAME . " هناك دائمًا شيء لتفعله! بينما تنتظر وصول جيشك الجديد،<br \/><br \/>قم بزيادة مستوى حطاب إضافي، حفرة طين، منجم حديد، وحقل قمح إلى المستوى 1.");
define("Q25_9_ORDER","التعليمات:<\/p>قم بزيادة مستوى واحد إضافي من كل نوع من الموارد إلى المستوى 1.");
define("Q25_9_RESP","جيد جدًا، تطور رائع في إنتاج الموارد.");

define("Q25_10","المهمة 10: قريبًا!");
define("Q25_10_DESC","الآن حان وقت استراحة صغيرة حتى يصل الجيش الضخم الذي أرسلته إليك.<br \/><br \/>حتى ذلك الحين يمكنك استكشاف الخريطة أو زيادة مستوى بعض بلاطات الموارد.");
define("Q25_10_ORDER","التعليمات:<\/p>انتظر حتى يصل جيش مدير المهام.");
define("Q25_10_RESP","الآن وصل جيش ضخم من مدير المهام لحماية قريتك.");
define("Q25_10_REWARD","مكافأتك:<\/p>يومان إضافيان من Travian");

define("Q25_11","المهمة 11: التقارير");
define("Q25_11_DESC","في كل مرة يحدث شيء مهم في حسابك ستتلقى تقريرًا.<br \/><br \/>يمكنك رؤيتها بالنقر على النصف الأيسر من الزر الخامس (من اليسار إلى اليمين). اقرأ التقرير وعد هنا.");
define("Q25_11_ORDER","التعليمات:<\/p>اقرأ أحدث تقرير لديك.");
define("Q25_11_RESP","هل استلمته؟ جيد جدًا. هنا مكافأتك.");

define("Q25_12","المهمة 12: كل شيء إلى 1.");
define("Q25_12_DESC","الآن يجب أن نزيد إنتاج الموارد قليلاً.");
define("Q25_12_ORDER","التعليمات:<\/p>قم بزيادة مستوى جميع بلاطات الموارد إلى المستوى 1.");
define("Q25_12_RESP","جيد جدًا، إنتاج مواردك يزدهر الآن.<br \/><br \/>قريبًا يمكننا البدء ببناء المباني داخل القرية.");

define("Q25_13","المهمة 13: حمامة السلام");
define("Q25_13_DESC","الأيام الأولى بعد التسجيل تكون محميًا من الهجمات من قبل اللاعبين الآخرين. يمكنك معرفة مدة هذه الحماية عن طريق إضافة الكود <b>[#0]<\/b> إلى ملفك الشخصي.");
define("Q25_13_ORDER","التعليمات:<\/p>اكتب الكود <b>[#0]<\/b> في ملفك الشخصي بإضافته إلى أحد حقول الوصف.");
define("Q25_13_RESP","أحسنت! الآن يمكن للجميع أن يروا أي محارب عظيم يقترب منهم.");

define("Q25_14","المهمة 14: المخزن السري");
define("Q25_14_DESC","حان الوقت لإنشاء مخزن سري. عالم <b>" . SERVER_NAME. "</b> خطير.<br \/><br \/>العديد من اللاعبين يعيشون عن طريق سرقة موارد اللاعبين الآخرين. قم ببناء مخزن سري لإخفاء بعض مواردك عن الأعداء.");
define("Q25_14_ORDER","التعليمات:<\/p>قم ببناء مخزن سري.");
define("Q25_14_RESP","أحسنت! الآن أصبح من الصعب على اللاعبين الآخرين نهب قريتك.<br \/><br \/>في حالة الهجوم، سيقوم قرويك بإخفاء الموارد في المخزن السري تلقائيًا.");

define("Q25_15","المهمة 15: إلى المستوى 2.");
define("Q25_15_DESC","في <b>" . SERVER_NAME. "</b> هناك دائمًا شيء لتفعله! قم بزيادة مستوى الحطاب، حفرة الطين، منجم الحديد، وحقل القمح إلى المستوى 2.");
define("Q25_15_ORDER","التعليمات:<\/p>قم بزيادة مستوى كل نوع من الموارد إلى المستوى 2.");
define("Q25_15_RESP","جيد جدًا، قريتك تنمو وتزدهر!");

define("Q25_16","المهمة 16: التعليمات");
define("Q25_16_DESC","في التعليمات داخل اللعبة، يمكنك العثور على نصوص قصيرة حول المباني وأنواع الوحدات المختلفة.<br \/><br \/>اضغط على 'التعليمات' في اليسار لتعرف كم تحتاج الثكنات من الأخشاب.");
define("Q25_16_ORDER","التعليمات:<\/p>أدخل كمية الأخشاب التي تحتاجها الثكنات.");
define("Q25_16_BUTN","إكمال المهمة");
define("Q25_16_RESP","بالضبط! الثكنات تكلف 210 وحدة من الأخشاب.");

define("Q25_17","المهمة 17: المبنى الرئيسي");
define("Q25_17_DESC","يحتاج عمالك المهرة إلى مبنى رئيسي من المستوى 3 لتشييد مبانٍ هامة مثل السوق أو الثكنات.");
define("Q25_17_ORDER","التعليمات:<\/p>قم بزيادة مستوى المبنى الرئيسي إلى المستوى 3.");
define("Q25_17_RESP","أحسنت! تم إكمال المبنى الرئيسي إلى المستوى 3.<br><br>مع هذا الترقية، يمكن لعمالك المهرة بناء أنواع جديدة من المباني والعمل بسرعة أكبر.");

define("Q25_18","المهمة 18: تقدم!");
define("Q25_18_DESC","ابحث عن ترتيبك في إحصائيات اللاعبين مرة أخرى واستمتع بتقدمك.");
define("Q25_18_ORDER","التعليمات:<\/p>ابحث عن ترتيبك في الإحصائيات وأدخله هنا.");
define("Q25_18_RESP","أحسنت! هذا هو ترتيبك الحالي.");


define("Q25_19","المهمة 19: أسلحة أم تجارة");
define("Q25_19_DESC","الآن عليك اتخاذ قرار: إما أن تتاجر بسلام أو تصبح محاربًا مرهوب الجانب.<br \/><br \/>للسوق تحتاج إلى مخزن حبوب، وللثكنات تحتاج إلى نقطة تجمع.");
define("Q25_19_BUTN","اقتصاد");
define("Q25_19_BUTN1","عسكري");

define("Q25_20","المهمة 20: الاقتصاد");
define("Q25_20_DESC","التجارة والاقتصاد كانا خيارك. أوقات ذهبية بانتظارك بالتأكيد!");
define("Q25_20_ORDER","التعليمات:<\/p>قم ببناء مخزن حبوب.");
define("Q25_20_RESP","أحسنت! مع مخزن الحبوب يمكنك تخزين المزيد من القمح.");

define("Q25_21","المهمة 21: المخزن");
define("Q25_21_DESC","ليس القمح فقط هو الذي يجب حفظه. الموارد الأخرى يمكن أن تضيع أيضًا إذا لم يتم تخزينها بشكل صحيح. قم ببناء مخزن!");
define("Q25_21_ORDER","التعليمات:<\/p>قم ببناء مخزن.");
define("Q25_21_RESP","أحسنت! تم اكتمال المخزن...<br \/>الآن لقد استوفيت جميع المتطلبات اللازمة لبناء السوق.");

define("Q25_22","المهمة 22: السوق.");
define("Q25_22_DESC","قم ببناء سوق لتتمكن من التجارة مع اللاعبين الآخرين.");
define("Q25_22_ORDER","التعليمات:<\/p>يرجى بناء سوق.");
define("Q25_22_RESP","تم اكتمال السوق. الآن يمكنك تقديم عروضك الخاصة وقبول العروض الخارجية! عند إنشاء عروضك الخاصة، يجب أن تفكر في تقديم ما يحتاجه اللاعبون الآخرون للحصول على المزيد من الأرباح.");

define("Q25_23","المهمة 23: العسكري");
define("Q25_23_DESC","قرار شجاع. لتتمكن من إرسال القوات، تحتاج إلى نقطة تجمع.<br \/><br \/>يجب بناء نقطة التجمع على موقع بناء محدد. موقع البناء ");
define("Q25_23_DESC1",".");
define("Q25_23_DESC2"," يقع على الجانب الأيمن من المبنى الرئيسي، أسفل قليلاً. الموقع نفسه منحني.");
define("Q25_23_ORDER","التعليمات:<\/p>قم ببناء نقطة تجمع.");
define("Q25_23_RESP","تم بناء نقطة التجمع الخاصة بك! خطوة جيدة نحو السيطرة على العالم!");


define("Q25_24","المهمة 24: الثكنات");
define("Q25_24_DESC","الآن لديك مبنى رئيسي بمستوى 3 ونقطة تجمع. هذا يعني أن جميع المتطلبات اللازمة لبناء الثكنات قد تم تلبيتها.<br><br>يمكنك استخدام الثكنات لتدريب القوات للقتال.");
define("Q25_24_ORDER","التعليمات:<\/p>قم ببناء ثكنات.");
define("Q25_24_RESP","أحسنت! اجتمع أفضل المدربين من جميع أنحاء البلاد لتطوير مهارات مقاتليك إلى أعلى مستوى.");

define("Q25_25","المهمة 25: التدريب.");
define("Q25_25_DESC","الآن بعد أن أصبح لديك ثكنات، يمكنك البدء بتدريب القوات. قم بتدريب جنديين.");
define("Q25_25_ORDER","يرجى تدريب 2 ");
define("Q25_25_RESP","تم وضع أساس جيشك المجيد.<br \/><br \/>قبل إرسال جيشك للنهب، يُفضل التحقق باستخدام");
define("Q25_25_RESP1","محاكي المعركة");
define("Q25_25_RESP2","لمعرفة عدد القوات اللازمة لقتال فأر واحد بنجاح دون خسائر.");

define("Q25_26","المهمة 26: كل شيء إلى 2.");
define("Q25_26_DESC","حان الوقت مرة أخرى لتوسيع أساسات القوة والثروة! هذه المرة المستوى 1 ليس كافيًا... سيستغرق الأمر وقتًا ولكنه في النهاية يستحق ذلك. قم بزيادة مستوى جميع بلاطات الموارد إلى المستوى 2!");
define("Q25_26_ORDER","التعليمات:<\/p>قم بزيادة مستوى جميع بلاطات الموارد إلى المستوى 2.");
define("Q25_26_RESP","تهانينا! قريتك تنمو وتزدهر...");

define("Q25_27","المهمة 27: الأصدقاء.");
define("Q25_27_DESC","كمُنفرد، من الصعب المنافسة ضد المهاجمين. من مصلحتك أن يحبك جيرانك.<br \/><br \/>ومن الأفضل أن تلعب مع الأصدقاء. هل تعلم أنه يمكنك كسب <img src='img/x.gif' class='gold' alt='ذهب' title='ذهب'> بدعوة الأصدقاء؟");
define("Q25_27_ORDER","التعليمات:<\/p>كم من <img src='img/x.gif' class='gold' alt='ذهب' title='ذهب'> تحصل عليه عند دعوة صديق؟");
define("Q25_27_RESP","صحيح! تحصل على 50 <img src='img/x.gif' class='gold' alt='ذهب' title='ذهب'> إذا كان لصديقك المدعو قريتان.");

define("Q25_28","المهمة 28: بناء السفارة.");
define("Q25_28_DESC","عالم Travian خطير. لقد قمت ببناء مخزن سري لحمايتك من المهاجمين.<br \/><br \/>تحالف جيد سيمنحك حماية أفضل.");
define("Q25_28_ORDER","التعليمات:<\/p>لقبول دعوات من التحالفات، قم ببناء سفارة.");
define("Q25_28_RESP","نعم! يمكنك انتظار دعوة من تحالف أو إنشاء تحالف خاص بك إذا كانت السفارة بمستوى 3.");

define("Q25_29","المهمة 29: التحالف.");
define("Q25_29_DESC","التعاون مهم في Travian. اللاعبون الذين يعملون معًا ينظمون أنفسهم في تحالفات. احصل على دعوة من تحالف في منطقتك وانضم إليه. كبديل، يمكنك تأسيس تحالف خاص بك. للقيام بذلك، تحتاج إلى سفارة بمستوى 3.");
define("Q25_29_ORDER","التعليمات:<\/p>انضم إلى تحالف أو أسس تحالفك الخاص.");
define("Q25_29_RESP","أحسنت! الآن أنت في اتحاد يُدعى");
define("Q25_29_RESP1",", وأنت عضو في تحالفهم.<br>بالتعاون معًا ستتقدمون جميعًا بشكل أسرع...");

define("Q25_30","المهام");
define("Q25_30_DESC","تم تحقيق جميع المهام!");


//======================================================//
//================ UNITS - DO NOT EDIT! ================//
//======================================================//
define("U0","Hero");

//ROMAN UNITS
define("U1","الجندي المهاجم");
define("U2","الجندي المدافع");
define("U3","الإمبراطوري");
define("U4","فرسان الكشافة");
define("U5","فرسان القيصر");
define("U6","فرسان الإمبراطور");
define("U7","محطمة الأبواب");
define("U8","المقلاع الناري");
define("U9","السيناتور");
define("U10","المستوطن");

//TEUTON UNITS
define("U11","مقاتل الهراوة");
define("U12","رامي الرمح");
define("U13","مقاتل الفأس");
define("U14","الكشاف");
define("U15","الفارس النبيل");
define("U16","فارس التيوتونيك");
define("U17","محطمة الأبواب");
define("U18","المقلاع");
define("U19","الزعيم");
define("U20","المستوطن");

//GAUL UNITS
define("U21","الرماح");
define("U22","مبارز السيف");
define("U23","مكتشف الطرق");
define("U24","رعد التوتاتس");
define("U25","فارس الكهنة");
define("U26","هيدوان");
define("U27","محطمة الأبواب");
define("U28","المنجنيق");
define("U29","الزعيم");
define("U30","المستوطن");
define("U99","الفخ");

//NATURE UNITS
define("U31","الفأر");
define("U32","العنكبوت");
define("U33","الأفعى");
define("U34","الخفاش");
define("U35","الخنزير البري");
define("U36","الذئب");
define("U37","الدب");
define("U38","التمساح");
define("U39","النمر");
define("U40","الفيل");

//NATARS UNITS
define("U41","رمّاح");
define("U42","المحارب الشائك");
define("U43","حارس");
define("U44","طيور الفريسة");
define("U45","راكب الفأس");
define("U46","فارس النَتَار");
define("U47","فيل الحرب");
define("U48","البلستا");
define("U49","إمبراطور النَتَار");
define("U50","مستوطن النَتَار");

//MONSTER UNITS
define("U51","عامل الوحش");
define("U52","صياد الوحوش");
define("U53","محارب الوحوش");
define("U54","الشبح");
define("U55","جواد الوحوش");
define("U56","جواد حرب الوحوش");
define("U57","محطمة أبواب الوحوش");
define("U58","منجنيق الوحوش");
define("U59","زعيم الوحوش");
define("U60","مستوطن الوحوش");

// RESOURCES
define("R1","الأخشاب");
define("R2","الطين");
define("R3","الحديد");
define("R4","القمح");

//INDEX.php
define("LOGIN","تسجيل الدخول");
define("PLAYERS","اللاعبين");
define("MODERATOR","المشرف");
define("ACTIVE","نشط");
define("ONLINE","متصل");
define("TUTORIAL","الدليل التعليمي");
define("PLAYER_STATISTICS","إحصائيات اللاعبين");
define("TOTAL_PLAYERS","إجمالي ".PLAYERS."");
define("ACTIVE_PLAYERS","اللاعبون النشطون");
define("ONLINE_PLAYERS","".PLAYERS." المتصلون");
define("MP_STRATEGY_GAME","".SERVER_NAME." - لعبة استراتيجية متعددة اللاعبين");
define("WHAT_IS","".SERVER_NAME." واحدة من أشهر ألعاب المتصفح في العالم. كلاعب في ".SERVER_NAME.", ستقوم ببناء إمبراطوريتك الخاصة، تجنيد جيش قوي، ومحاربة أعدائك مع حلفائك لتحقيق الهيمنة في عالم اللعبة.");
define("REGISTER_FOR_FREE","سجل هنا مجانًا!");
define("LATEST_GAME_WORLD","أحدث عالم للعبة");
define("LATEST_GAME_WORLD2","سجل الآن في أحدث<br/>عالم للعبة واستمتع<br/>بمزايا أن تكون من<br/>أوائل اللاعبين.");
define("PLAY_NOW","العب ".SERVER_NAME." الآن");
define("LEARN_MORE","تعرف أكثر <br/>عن ".SERVER_NAME."!");
define("LEARN_MORE2","الآن مع نظام خوادم ثوري<br/>ورسومات جديدة بالكامل<br/>هذا النسخة تعتبر الأفضل!");
define("COMUNITY","المجتمع");
define("BECOME_COMUNITY","كن جزءًا من مجتمعنا الآن!");
define("BECOME_COMUNITY2","كن جزءًا من أحد<br/>أكبر مجتمعات الألعاب<br/>في العالم.");
define("NEWS","الأخبار");
define("SCREENSHOTS","لقطات الشاشة");
define("LEARN1","قم بترقية الحقول والمناجم لزيادة إنتاج الموارد. ستحتاج الموارد لبناء المباني وتدريب الجنود.");
define("LEARN2","قم ببناء وتوسيع المباني في قريتك. تعزز المباني بنيتك التحتية، تزيد من إنتاج الموارد، وتتيح لك البحث، تدريب، وترقية القوات.");
define("LEARN3","شاهد وتفاعل مع محيطك. يمكنك تكوين أصدقاء جدد أو أعداء جدد، استغلال الواحات القريبة، ومتابعة نمو إمبراطوريتك وتقويتها.");
define("LEARN4","تابع تقدمك ونجاحك وقارن نفسك باللاعبين الآخرين. راجع ترتيب أفضل 10 وحارب للفوز بميدالية أسبوعية.");
define("LEARN5","استلم تقارير تفصيلية حول مغامراتك، تجارتك ومعاركك. لا تنسَ التحقق من التقارير الجديدة حول الأحداث الجارية في محيطك.");
define("LEARN6","تبادل المعلومات وقم بالدبلوماسية مع اللاعبين الآخرين. تذكر دائمًا أن التواصل هو المفتاح لتكوين صداقات جديدة وحل النزاعات القديمة.");
define("LOGIN_TO","سجل الدخول إلى ". SERVER_NAME);
define("REGIN_TO","سجل في ". SERVER_NAME);
define("P_ONLINE","اللاعبون المتصلون: ");
define("P_TOTAL","إجمالي اللاعبين: ");
define("CHOOSE","يرجى اختيار خادم.");
define("STARTED"," بدأ الخادم منذ ". round((time()-COMMENCE)/86400) ." يومًا.");

//ANMELDEN.php
define("NICKNAME","الاسم المستعار");
define("EMAIL","البريد الإلكتروني");
define("PASSWORD","كلمة المرور");
define("ROMANS","الرومان");
define("TEUTONS","الجرمان");
define("GAULS","الإغريق");
define("NW","الشمال الغربي");
define("NE","الشمال الشرقي");
define("SW","الجنوب الغربي");
define("SE","الجنوب الشرقي");
define("RANDOM","عشوائي");
define("ACCEPT_RULES"," أوافق على قواعد اللعبة والشروط والأحكام العامة.");
define("ONE_PER_SERVER","يمكن لكل لاعب امتلاك حساب واحد فقط لكل خادم.");
define("BEFORE_REGISTER","قبل أن تسجل حسابًا، يجب عليك قراءة <a href='../anleitung.php' target='_blank'>دليل اللعبة</a> لمعرفة المزايا والعيوب الخاصة بكل قبيلة.");
define("BUILDING_UPGRADING","بناء:");
define("HOURS","ساعات");

//الهجمات وما إلى ذلك
define("TROOP_MOVEMENTS","حركات القوات:");
define("ARRIVING_REINF_TROOPS","القوات التعزيزية القادمة");
define("ARRIVING_ATTACKING_TROOPS","القوات المهاجمة القادمة");
define("ARRIVING_REINF_TROOPS_SHORT","تعزيز.");
define("OWN_ATTACKING_TROOPS","القوات المهاجمة الخاصة");
define("ATTACK","هجوم");
define("OWN_REINFORCING_TROOPS","القوات التعزيزية الخاصة");
define("TROOPS_DORF","القوات:");
define("NEWVILLAGE","قرية جديدة.");
define("FOUNDNEWVILLAGE","تأسيس قرية جديدة");
define("UNDERATTACK","القرية تحت الهجوم");
define("OASISATTACK","الواحة تحت الهجوم");
define("OASISATTACKS","هجمات الواحة");
define("RETURNFROM","عودة من");
define("REINFORCEMENTFOR","تعزيز إلى");
define("ATTACK_ON","هجوم إلى");
define("RAID_ON","غارة إلى");
define("SCOUTING","استطلاع");
define("PRISONERS","الأسرى");
define("PRISONERSIN","أسرى في");
define("PRISONERSFROM","أسرى من");
define("TROOPS","القوات");
define("TROOPSFROM","القوات من");
define("BOUNTY","الغنائم");
define("ARRIVAL","الوصول");
define("CATAPULT_TARGET","هدف/أهداف المنجنيق");
define("INCOMING_TROOPS","القوات القادمة");
define("TROOPS_ON_THEIR_WAY","القوات في طريقها");
define("OWN_TROOPS","القوات الخاصة");
define("ON","على");
define("AT","في");
define("UPKEEP","الصيانة");
define("SEND_BACK","إعادة الإرسال");
define("TROOPS_IN_THE_VILLAGE","القوات في القرية");
define("TROOPS_IN_OTHER_VILLAGE","القوات في قرية أخرى");
define("TROOPS_IN_OASIS","القوات في الواحة");
define("KILL","قتل");
define("FROM","من");
define("SEND_TROOPS","إرسال القوات");
define("TASKMASTER","مدير المهام");
define("VILLAGE_OF_THE_ELDERS_TROOPS","قوات قرية الشيوخ");

//SEND TROOP
define("REINFORCE","تعزيز");
define("NORMALATTACK","هجوم عادي");
define("RAID","غارة");
define("OR","أو");
define("SENDTROOP","إرسال القوات");
define("TROOP","القوات");
define("NOTROOP","لا توجد قوات");

//الخريطة
define("DETAIL","التفاصيل");
define("ABANDVALLEY","وادي مهجور");
define("OCCUPIED","محتل");
define("UNOCCUPIED","غير محتلة");
define("UNOCCUOASIS","واحة غير محتلة");
define("OCCUOASIS","واحة محتلة");
define("THERENOINFO","لا توجد<br>معلومات متوفرة.");
define("LANDDIST","توزيع الأراضي");
define("TRIBE","القبيلة");
define("ALLIANCE","التحالف");
define("POP","السكان");
define("REPORT","تقرير");
define("OPTION","الخيارات");
define("CENTREMAP","توسيط الخريطة");
define("FNEWVILLAGE","تأسيس قرية جديدة");
define("CULTUREPOINT","النقاط الثقافية");
define("BUILDRALLY","بناء نقطة تجمع");
define("SETTLERSAVAIL","المستوطنون متاحون");
define("BEGINPRO","حماية المبتدئين");
define("SENDMERC","إرسال التاجر/التجار");
define("BAN","اللاعب محظور");
define("BUILDMARKET","بناء السوق");
define("PERHOUR","لكل ساعة");
define("BONUS","المكافأة");
define("MAP","الخريطة");
define("CROPFINDER","البحث عن الحقول");
define("NORTH","الشمال");
define("EAST","الشرق");
define("SOUTH","الجنوب");
define("WEST","الغرب");

//أخرى
define("VILLAGE","القرية");
define("OASIS","الواحة");
define("NO_OASIS", "أنت لا تملك أي واحات.");
define("NO_VILLAGES", "لا توجد قرى.");
define("PLAYER","اللاعب");

//LOGIN.php
define("COOKIES","يجب تفعيل الكوكيز لتتمكن من تسجيل الدخول. إذا كنت تشارك هذا الكمبيوتر مع أشخاص آخرين، يجب عليك تسجيل الخروج بعد كل جلسة لضمان سلامتك.");
define("NAME","الاسم");
define("PW_FORGOTTEN","نسيت كلمة المرور؟");
define("PW_REQUEST","يمكنك طلب كلمة مرور جديدة سيتم إرسالها إلى بريدك الإلكتروني.");
define("PW_GENERATE","إنشاء كلمة مرور جديدة.");
define("EMAIL_NOT_VERIFIED","البريد الإلكتروني غير مفعل!");
define("EMAIL_FOLLOW","اتبع هذا الرابط لتفعيل حسابك.");
define("VERIFY_EMAIL","تفعيل البريد الإلكتروني.");
define("SERVER_STARTS_IN","الخادم سيبدأ خلال: ");
define("START_NOW","ابدأ الآن");


//404.php
define("NOTHING_HERE","لا يوجد شيء هنا!");
define("WE_LOOKED","بحثنا 404 مرة ولكن لم نجد أي شيء.");

//الوقت
define("CALCULATED","محسوب خلال");
define("SERVER_TIME","وقت الخادم:");

//MASSMESSAGE.php
define("MASS","محتوى الرسالة");
define("MASS_SUBJECT","الموضوع:");
define("MASS_COLOR","لون الرسالة:");
define("MASS_REQUIRED","جميع الحقول مطلوبة");
define("MASS_UNITS","الصور (الوحدات):");
define("MASS_SHOWHIDE","إظهار/إخفاء");
define("MASS_READ","اقرأ هذا: بعد إضافة الوجه التعبيري، يجب إضافة 'يسار' أو 'يمين' بعد الرقم، وإلا لن تعمل الصورة.");
define("MASS_CONFIRM","تأكيد");
define("MASS_REALLY","هل تريد حقًا إرسال رسالة جماعية؟");
define("MASS_ABORT","تم الإلغاء الآن");
define("MASS_SENT","تم إرسال الرسالة الجماعية");

//المباني
define("WOODCUTTER","الحطاب");
define("CLAYPIT","حفرة الطين");
define("IRONMINE","منجم الحديد");
define("CROPLAND","حقل القمح");

define("SAWMILL","نشارة الخشب");
define("SAWMILL_DESC","هنا يتم معالجة الخشب الذي يتم تسليمه بواسطة الحطابين. بناءً على مستوى المنشرة، يمكنها زيادة إنتاج الخشب بنسبة تصل إلى 25 بالمائة.");
define("CURRENT_WOOD_BONUS","مكافأة الخشب الحالية:");
define("WOOD_BONUS_LEVEL","مكافأة الخشب عند المستوى");
define("MAX_LEVEL","المبنى بالفعل في أقصى مستوى");
define("PERCENT","النسبة المئوية");

define("BRICKYARD","مصنع الطوب");
define("CURRENT_CLAY_BONUS","مكافأة الطين الحالية:");
define("CLAY_BONUS_LEVEL","مكافأة الطين عند المستوى");
define("BRICKYARD_DESC","هنا يتم معالجة الطين إلى طوب. بناءً على مستواها، يمكن لمصنع الطوب زيادة إنتاج الطين بنسبة تصل إلى 25 بالمائة.");

define("IRONFOUNDRY","مصنع الحديد");
define("CURRENT_IRON_BONUS","مكافأة الحديد الحالية:");
define("IRON_BONUS_LEVEL","مكافأة الحديد عند المستوى");
define("IRONFOUNDRY_DESC","يتم صهر الحديد هنا. بناءً على مستواه، يمكن لمصنع الحديد زيادة إنتاج الحديد بنسبة تصل إلى 25 بالمائة.");

define("GRAINMILL","مطحنة الحبوب");
define("CURRENT_CROP_BONUS","مكافأة القمح الحالية:");
define("CROP_BONUS_LEVEL","مكافأة القمح عند المستوى");
define("GRAINMILL_DESC","هنا يتم طحن الحبوب لإنتاج الدقيق. بناءً على مستوى المطحنة، يمكنها زيادة إنتاج القمح بنسبة تصل إلى 25 بالمائة.");

define("BAKERY","المخبز");
define("BAKERY_DESC","هنا يتم استخدام الدقيق المنتج في المطحنة لخبز الخبز. مع مطحنة الحبوب يمكن أن تصل زيادة إنتاج القمح إلى 50 بالمائة.");

define("WAREHOUSE","المخزن");
define("CURRENT_CAPACITY","السعة الحالية:");
define("CAPACITY_LEVEL","السعة عند المستوى");
define("RESOURCE_UNITS","وحدات الموارد");
define("WAREHOUSE_DESC","يتم تخزين الأخشاب والطين والحديد في المخزن. بزيادة مستوى المخزن، تزداد سعته.");

define("GRANARY","مخزن الحبوب");
define("CROP_UNITS","وحدات القمح");
define("GRANARY_DESC","يتم تخزين القمح المنتج من مزارعك في مخزن الحبوب. بزيادة مستواه، تزداد سعته.");

define("BLACKSMITH","الحداد");
define("ACTION","الإجراء");
define("UPGRADE","الترقية");
define("UPGRADE_IN_PROGRESS","الترقية<br>جارية");
define("UPGRADE_BLACKSMITH","ترقية<br>الحداد");
define("UPGRADES_COMMENCE_BLACKSMITH","يمكن بدء الترقيات عند اكتمال الحداد.");
define("MAXIMUM_LEVEL","المستوى<br>الأقصى");
define("EXPAND_WAREHOUSE","توسيع<br>المخزن");
define("EXPAND_GRANARY","توسيع<br>مخزن الحبوب");
define("ENOUGH_RESOURCES","موارد كافية");
define("CROP_NEGATIVE ","إنتاج القمح سلبي لذا لن تصل أبدًا إلى الموارد المطلوبة");
define("TOO_FEW_RESOURCES","عدد قليل جدًا<br>من الموارد");
define("UPGRADING","جارٍ الترقية");
define("DURATION","المدة");
define("COMPLETE","اكتمل");
define("BLACKSMITH_DESC","في أفران صهر الحداد يتم تحسين أسلحة محاربيك. بزيادة مستواه يمكنك طلب تصنيع أسلحة أفضل.");

define("ARMOURY","الدرع");
define("UPGRADE_ARMOURY","ترقية<br>الدرع");
define("UPGRADES_COMMENCE_ARMOURY","يمكن بدء الترقيات عند اكتمال الدرع.");
define("ARMOURY_DESC","في أفران صهر الدرع يتم تحسين دروع محاربيك. بزيادة مستواه يمكنك طلب تصنيع دروع أفضل.");

define("TOURNAMENTSQUARE","ساحة البطولة");
define("CURRENT_SPEED","مكافأة السرعة الحالية:");
define("SPEED_LEVEL","مكافأة السرعة عند المستوى");
define("TOURNAMENTSQUARE_DESC","في ساحة البطولة يمكن لقواتك تدريب قدرتها على التحمل. كلما زاد مستوى البناء، زادت سرعة قواتك عند تجاوز مسافة ".TS_THRESHOLD." مربعات.");

define("MAINBUILDING","المبنى الرئيسي");
define("CURRENT_CONSTRUCTION_TIME","مدة البناء الحالية:");
define("CONSTRUCTION_TIME_LEVEL","مدة البناء عند المستوى");
define("DEMOLITION_BUILDING","هدم المبنى:</h2><p>إذا لم تعد بحاجة إلى مبنى، يمكنك طلب هدمه.</p>");
define("DEMOLISH","هدم");
define("DEMOLITION_OF","هدم ");
define("MAINBUILDING_DESC","في المبنى الرئيسي يعيش بناة القرية الرئيسيون. كلما زاد مستواه، أسرع بناة القرية في إكمال بناء المباني الجديدة.");

define("RALLYPOINT","نقطة التجمع");
define("RALLYPOINT_COMMENCE","سيتم عرض تحركات القوات عند اكتمال ".RALLYPOINT.".");
define("OVERVIEW","نظرة عامة");
define("REINFORCEMENT","تعزيز");
define("EVASION_SETTINGS","إعدادات الهروب");
define("SEND_TROOPS_AWAY_MAX","إرسال القوات بعيدًا بحد أقصى");
define("TIMES","مرات");
define("PER_EVASION","لكل هروب");
define("RALLYPOINT_DESC","تجتمع قوات قريتك هنا. من هنا يمكنك إرسالهم لغزو، غارة، أو تعزيز قرى أخرى.");

define("MARKETPLACE","السوق");
define("MERCHANT","التجار");
define("OR_","أو");
define("GO","اذهب");
define("UNITS_OF_RESOURCE","وحدات من الموارد");
define("MERCHANT_CARRY","كل تاجر يمكنه حمل");
define("MERCHANT_COMING","التجار القادمين");
define("TRANSPORT_FROM","النقل من");
define("ARRIVAL_IN","الوصول خلال");
define("NO_COORDINATES_SELECTED","لم يتم اختيار إحداثيات");
define("CANNOT_SEND_RESOURCES","لا يمكنك إرسال الموارد إلى نفس القرية");
define("BANNED_CANNOT_SEND_RESOURCES","اللاعب محظور. لا يمكنك إرسال الموارد إليه");
define("RESOURCES_NO_SELECTED","لم يتم اختيار الموارد");
define("ENTER_COORDINATES","أدخل الإحداثيات أو اسم القرية");
define("TOO_FEW_MERCHANTS","عدد قليل جدًا من التجار");
define("OWN_MERCHANTS_ONWAY","التجار الخاصون في الطريق");
define("MERCHANTS_RETURNING","التجار العائدون");
define("TRANSPORT_TO","النقل إلى");
define("I_AN_SEARCHING","أنا أبحث عن");
define("I_AN_OFFERING","أنا أعرض");
define("OFFERS_MARKETPLACE","العروض في السوق");
define("NO_AVAILABLE_OFFERS","لا توجد عروض في السوق");
define("OFFERED_TO_ME","عُرضت<br>عليّ");
define("WANTED_TO_ME","مطلوب<br>مني");
define("NOT_ENOUGH_MERCHANTS","عدد غير كافٍ من التجار");
define("ACCEP_OFFER","قبول العرض");
define("NO_AVALIBLE_OFFERS","لا توجد عروض متوفرة في السوق");
define("SEARCHING","البحث");
define("OFFERING","العرض");
define("MAX_TIME_TRANSPORT","الحد الأقصى لوقت النقل");
define("OWN_ALLIANCE_ONLY","التحالف الخاص فقط");
define("INVALID_OFFER","عرض غير صالح");
define("INVALID_MERCHANTS_REPETITION","معدل تكرار التجار غير صالح");
define("USER_ON_VACATION","اللاعب في وضع الإجازة");
define("NOT_ENOUGH_RESOURCES","الموارد غير كافية");
define("OFFER","عرض");
define("SEARCH","بحث");
define("OWN_OFFERS","العروض الخاصة");
define("ALL","الكل");
define("NPC_TRADE","التجارة عبر NPC");
define("SUM","المجموع");
define("REST","الباقي");
define("TRADE_RESOURCES","تجارة الموارد (الخطوة 2 من 2)");
define("DISTRIBUTE_RESOURCES","توزيع الموارد (الخطوة 1 من 2)");
define("OF","من");
define("NPC_COMPLETED","اكتمل التجارة عبر NPC");
define("BACK_BUILDING","العودة إلى المبنى");
define("YOU_CAN_NAT_NPC_WW","لا يمكنك استخدام التجارة عبر NPC في قرية WW.");
define("NPC_TRADING","التجارة عبر NPC");
define("SEND_RESOURCES","إرسال الموارد");
define("BUY","شراء");
define("TRADE_ROUTES","طرق التجارة");
define("DESCRIPTION","الوصف");
define("TIME_LEFT","الوقت المتبقي");
define("START","البدء");
define("NO_TRADE_ROUTES","لا توجد طرق تجارة نشطة");
define("TRADE_ROUTE_TO","طريق التجارة إلى");
define("CHECKED","تم التحقق");
define("DAYS","أيام");
define("EXTEND","تمديد");
define("EDIT","تعديل");
define("EXTEND_TRADE_ROUTES","تمديد طريق التجارة لمدة <b>7</b> أيام مقابل");
define("CREATE_TRADE_ROUTES","إنشاء طريق تجارة جديد");
define("DELIVERIES","التسليمات");
define("START_TIME_TRADE","وقت البدء");
define("CREATE_TRADE_ROUTE","إنشاء طريق تجارة");
define("TARGET_VILLAGE","القرية المستهدفة");
define("EDIT_TRADE_ROUTES","تعديل طريق التجارة");
define("TRADE_ROUTES_DESC","تسمح لك طريق التجارة بإنشاء مسارات لتجارك حيث يسيرون يوميًا في وقت محدد. <br /><br /> افتراضيًا، تستمر هذه المسارات لمدة <b>7</b> أيام، ولكن يمكنك تمديدها لمدة <b>7</b> أيام إضافية مقابل التكلفة.");
define("NPC_TRADE_DESC","مع التاجر NPC يمكنك توزيع الموارد في مخزنك كما ترغب. <br /><br /> السطر الأول يظهر المخزون الحالي. في السطر الثاني يمكنك اختيار توزيع آخر. السطر الثالث يظهر الفرق بين المخزون القديم والجديد.");
define("MARKETPLACE_DESC","في السوق يمكنك التجارة بالموارد مع لاعبين آخرين. كلما زاد مستواها، زادت كمية الموارد التي يمكن نقلها في نفس الوقت.");

define("EMBASSY","السفارة");
define("TAG","الاختصار");
define("TO_THE_ALLIANCE","إلى التحالف");
define("JOIN_ALLIANCE","الانضمام إلى التحالف");
define("REFUSE","رفض");
define("ACCEPT","قبول");
define("NO_INVITATIONS","لا توجد دعوات متاحة.");
define("NO_CREATE_ALLIANCE","لا يمكن للاعب المحظور إنشاء تحالف.");
define("FOUND_ALLIANCE","تأسيس تحالف");
define("EMBASSY_DESC","السفارة هي مكان للدبلوماسيين. كلما زاد مستواها، زادت الخيارات التي يحصل عليها الملك.");

define("BARRACKS","الثكنات");
define("QUANTITY","الكمية");
define("MAX","الحد الأقصى");
define("TRAINING","التدريب");
define("FINISHED","اكتمل");
define("UNIT_FINISHED","الوحدة التالية ستكتمل خلال");
define("AVAILABLE","متاح");
define("TRAINING_COMMENCE_BARRACKS","يمكن بدء التدريب عند اكتمال الثكنات.");
define("BARRACKS_DESC","يتم تدريب جميع المشاة في الثكنات. كلما زاد مستوى الثكنات، زادت سرعة تدريب القوات.");

define("STABLE","الإسطبل");
define("AVAILABLE_ACADEMY","لا توجد وحدات متاحة. قم بالبحث في الأكاديمية.");
define("TRAINING_COMMENCE_STABLE","يمكن بدء التدريب عند اكتمال الإسطبل.");
define("STABLE_DESC","يمكن تدريب الفرسان في الإسطبل. كلما زاد مستواه، زادت سرعة تدريب القوات.");

define("WORKSHOP","ورشة العمل");
define("TRAINING_COMMENCE_WORKSHOP","يمكن بدء التدريب عند اكتمال ورشة العمل.");
define("WORKSHOP_DESC","يمكن بناء آلات الحصار مثل المنجنيقات ومحطمات الأبواب في ورشة العمل. كلما زاد مستواها، زادت سرعة إنتاج الوحدات.");

define("ACADEMY","الأكاديمية");
define("RESEARCH_AVAILABLE","لا توجد أبحاث متاحة.");
define("RESEARCH_COMMENCE_ACADEMY","يمكن بدء البحث عند اكتمال الأكاديمية.");
define("RESEARCH","البحث");
define("EXPAND_WAREHOUSE1","توسيع المخزن");
define("EXPAND_GRANARY1","توسيع مخزن الحبوب");
define("RESEARCH_IN_PROGRESS","البحث<br>جاري");
define("RESEARCHING","جاري البحث");
define("PREREQUISITES","المتطلبات الأساسية");
define("SHOW_MORE","عرض المزيد");
define("HIDE_MORE","إخفاء المزيد");
define("ACADEMY_DESC","في الأكاديمية يمكن البحث عن أنواع جديدة من الوحدات. بزيادة مستواها يمكنك طلب بحث عن وحدات أفضل.");

define("CRANNY","المخبأ");
define("CURRENT_HIDDEN_UNITS","الوحدات المخفية حاليًا لكل مورد:");
define("HIDDEN_UNITS_LEVEL","الوحدات المخفية لكل مورد عند المستوى");
define("UNITS","الوحدات");
define("CRANNY_DESC","يستخدم المخبأ لإخفاء بعض مواردك عند مهاجمة القرية. هذه الموارد لا يمكن سرقتها.");

define("TOWNHALL","دار البلدية");
define("CELEBRATIONS_COMMENCE_TOWNHALL","يمكن بدء الاحتفالات عند اكتمال دار البلدية.");
define("GREAT_CELEBRATIONS","احتفال كبير");
define("CULTURE_POINTS","النقاط الثقافية");
define("HOLD","عقد");
define("CELEBRATIONS_IN_PROGRESS","الاحتفال<br />جارٍ");
define("CELEBRATIONS","الاحتفالات");
define("TOWNHALL_DESC","يمكنك إقامة احتفالات فخمة في دار البلدية. مثل هذا الاحتفال يزيد من النقاط الثقافية. بزيادة مستوى دار البلدية، تقل مدة الاحتفال.");

define("RESIDENCE","الإقامة");
define("CAPITAL","هذه هي عاصمتك");
define("RESIDENCE_TRAIN_DESC","لتأسيس قرية جديدة تحتاج إلى إقامة بمستوى 10 أو 20 و3 مستوطنين. ولغزو قرية جديدة تحتاج إلى إقامة بمستوى 10 أو 20 وسيناتور، زعيم، أو رئيس.");
define("PRODUCTION_POINTS","إنتاج هذه القرية:");
define("PRODUCTION_ALL_POINTS","إنتاج جميع القرى:");
define("POINTS_DAY","نقاط ثقافية يوميًا");
define("VILLAGES_PRODUCED","قراك أنتجت");
define("POINTS_NEED","نقطة إجمالاً. لتأسيس أو غزو قرية جديدة تحتاج إلى");
define("POINTS","نقاط");
define("INHABITANTS","السكان");
define("COORDINATES","الإحداثيات");
define("EXPANSION","التوسع");
define("TRAIN","تدريب");
define("DATE","التاريخ");
define("CONQUERED_BY_VILLAGE","القرى التي تأسست أو غزتها هذه القرية");
define("NONE_CONQUERED_BY_VILLAGE","لم يتم تأسيس أو غزو أي قرية من قبل هذه القرية حتى الآن.");
define("RESIDENCE_CULTURE_DESC","لتوسيع إمبراطوريتك تحتاج إلى نقاط ثقافية. تزيد هذه النقاط مع مرور الوقت وتزداد أسرع مع زيادة مستويات المباني.");
define("RESIDENCE_LOYALTY_DESC","من خلال الهجوم باستخدام السيناتورات، الزعماء، أو الرؤساء يمكن خفض ولاء القرية. إذا وصل إلى الصفر، تنضم القرية إلى مملكة المهاجم. ولاء هذه القرية حاليًا عند ");
define("RESIDENCE_DESC","الإقامة هي قصر صغير يعيش فيه الملك أو الملكة عند زيارتهم للقرية. تحمي الإقامة القرية من الأعداء الذين يرغبون في غزوها.");

define("PALACE","القصر");
define("PALACE_CONSTRUCTION","القصر قيد الإنشاء");
define("PALACE_TRAIN_DESC","لتأسيس قرية جديدة تحتاج إلى قصر بمستوى 10، 15 أو 20 و3 مستوطنين. ولغزو قرية جديدة تحتاج إلى قصر بمستوى 10، 15 أو 20 وسيناتور، زعيم، أو رئيس.");
define("CHANGE_CAPITAL","تغيير العاصمة");
define("SECURITY_CHANGE_CAPITAL","هل أنت متأكد من أنك تريد تغيير عاصمتك؟<br /><b>لا يمكنك التراجع عن هذا!</b><br />لضمان الأمان يجب إدخال كلمة المرور للتأكيد:<br />");
define("PALACE_DESC","يعيش الملك أو الملكة في القصر. يمكن أن يكون هناك قصر واحد فقط في إمبراطوريتك في وقت واحد. تحتاج إلى القصر لإعلان قرية عاصمة.");

define("TREASURY","الخزانة");
define("TREASURY_COMMENCE","يمكن عرض القطع الأثرية عند اكتمال الخزانة.");
define("ARTIFACTS_AREA","القطع الأثرية في منطقتك");
define("NO_ARTIFACTS_AREA","لا توجد قطع أثرية في منطقتك.");
define("OWN_ARTIFACTS","القطع الأثرية الخاصة");
define("CONQUERED","تم غزوها");
define("DISTANCE","المسافة");
define("EFFECT","التأثير");
define("ACCOUNT","الحساب");
define("SMALL_ARTIFACTS","القطع الأثرية الصغيرة");
define("LARGE_ARTIFACTS","القطع الأثرية الكبيرة");
define("NO_ARTIFACTS","لا توجد قطع أثرية.");
define("ANY_ARTIFACTS","لا تملك أي قطع أثرية.");
define("OWNER","المالك");
define("AREA_EFFECT","تأثير المنطقة");
define("VILLAGE_EFFECT","تأثير القرية");
define("ACCOUNT_EFFECT","تأثير الحساب");
define("UNIQUE_EFFECT","تأثير فريد");
define("REQUIRED_LEVEL","المستوى المطلوب");
define("TIME_CONQUER","وقت الغزو");
define("TIME_ACTIVATION","وقت التفعيل");
define("NEXT_EFFECT","التأثير التالي");
define("FORMER_OWNER","المالك السابق");
define("BUILDING_STRONGER","المباني تصبح أقوى مع");
define("BUILDING_WEAKER","المباني تصبح أضعف مع");
define("TROOPS_FASTER","القوات تصبح أسرع مع");
define("TROOPS_SLOWEST","القوات تصبح أبطأ مع");
define("SPIES_INCREASE","زيادة قدرة الجواسيس مع");
define("SPIES_DECRESE","انخفاض قدرة الجواسيس مع");
define("CONSUME_LESS","جميع القوات تستهلك أقل مع");
define("CONSUME_HIGH","جميع القوات تستهلك أكثر مع");
define("TROOPS_MAKE_FASTER","القوات تُصنع أسرع مع");
define("TROOPS_MAKE_SLOWEST","القوات تُصنع أبطأ مع");
define("YOU_CONSTRUCT","يمكنك بناء ");
define("CRANNY_INCREASED","سعة المخبأ زادت بمقدار");
define("CRANNY_DECRESE","سعة المخبأ انخفضت بمقدار");
define("WW_BUILDING_PLAN","يمكنك بناء معجزة العالم");
define("NO_WW","لا توجد معجزات العالم");
define("NO_PREVIOUS_OWNERS","لا يوجد ملاك سابقون.");
define("TREASURY_DESC","ثروات إمبراطوريتك محفوظة في الخزانة. تحتوي الخزانة على مكان لقطعة أثرية واحدة. بعد أن تستولي على قطعة أثرية، ستصبح فعالة بعد 24 ساعة في الخادم العادي أو 12 ساعة في خادم السرعة الثلاثية.");

define("TRADEOFFICE","مكتب التجارة");
define("CURRENT_MERCHANT","حمولة التاجر الحالية:");
define("MERCHANT_LEVEL","حمولة التاجر عند المستوى");
define("TRADEOFFICE_DESC","في مكتب التجارة يتم تحسين عربات التجار وتجهيزها بخيول قوية. كلما زاد مستوى المكتب، زادت قدرة التجار على الحمل.");

define("GREATBARRACKS","الثكنات الكبرى");
define("TRAINING_COMMENCE_GREATBARRACKS","يمكن بدء التدريب عند اكتمال الثكنات الكبرى.");
define("GREATBARRACKS_DESC","يتم تدريب المشاة في الثكنات الكبرى. كلما زاد مستوى الثكنات، زادت سرعة تدريب القوات.");

define("GREATSTABLE","الإسطبل الكبير");
define("TRAINING_COMMENCE_GREATSTABLE","يمكن بدء التدريب عند اكتمال الإسطبل الكبير.");
define("GREATSTABLE_DESC","يمكن تدريب الفرسان في الإسطبل الكبير. كلما زاد مستواه، زادت سرعة تدريب القوات.");

define("CITYWALL","السور");
define("DEFENCE_NOW","مكافأة الدفاع الحالية:");
define("DEFENCE_LEVEL","مكافأة الدفاع عند المستوى");
define("CITYWALL_DESC","من خلال بناء السور يمكنك حماية قريتك من جحافل الأعداء البرابرة. كلما زاد مستوى السور، زادت المكافأة الدفاعية للقوات.");

define("EARTHWALL","السور الطيني");
define("EARTHWALL_DESC","من خلال بناء السور الطيني يمكنك حماية قريتك من جحافل الأعداء البرابرة. كلما زاد مستوى السور، زادت المكافأة الدفاعية للقوات.");

define("PALISADE","السياج الخشبي");
define("PALISADE_DESC","من خلال بناء السياج الخشبي يمكنك حماية قريتك من جحافل الأعداء البرابرة. كلما زاد مستوى السياج، زادت المكافأة الدفاعية للقوات.");

define("STONEMASON","ورشة الحجار");
define("CURRENT_STABILITY","مكافأة الثبات الحالية:");
define("STABILITY_LEVEL","مكافأة الثبات عند المستوى");
define("STONEMASON_DESC","ورشة الحجار مختصة بقطع الحجارة. كلما تم تطوير المبنى، زادت ثباتية مباني القرية.");

define("BREWERY","المخمرة");
define("CURRENT_BONUS","المكافأة الحالية:");
define("BONUS_LEVEL","المكافأة عند المستوى");
define("BREWERY_DESC","يتم تخمير الميد اللذيذ في المخمرة ليتمتع به الجنود أثناء الاحتفالات.");

define("TRAPPER","الصياد");
define("CURRENT_TRAPS","الحد الأقصى للفخاخ التي يمكن تدريبها حاليًا:");
define("TRAPS_LEVEL","الحد الأقصى للفخاخ عند المستوى");
define("TRAPS","الفخاخ");
define("TRAP","الفخ");
define("CURRENT_HAVE","لديك حاليًا");
define("WHICH_OCCUPIED","منها مشغولة.");
define("TRAINING_COMMENCE_TRAPPER","يمكن بدء التدريب عند اكتمال الصياد.");
define("TRAPPER_DESC","الصياد يحمي قريتك بفخاخ مخفية جيدًا. هذا يعني أن الأعداء غير الحذرين يمكن أن يتم أسرهم ولن يكونوا قادرين على إلحاق الأذى بقريتك بعد الآن.");

define("HEROSMANSION","قصر البطل");
define("HERO_READY","سيكون البطل جاهزًا خلال ");
define("NAME_CHANGED","تم تغيير اسم البطل");
define("NOT_UNITS","لا توجد وحدات متاحة");
define("NOT","غير متاح ");
define("TRAIN_HERO","تدريب بطل جديد");
define("REVIVE","إحياء");
define("OASES","الواحات");
define("DELETE","حذف");
define("RESOURCES","الموارد");
define("OFFENCE","الهجوم");
define("DEFENCE","الدفاع");
define("OFF_BONUS","مكافأة الهجوم");
define("DEF_BONUS","مكافأة الدفاع");
define("REGENERATION","التجديد");
define("DAY","اليوم");
define("EXPERIENCE","الخبرة");
define("YOU_CAN","يمكنك ");
define("RESET","إعادة التعيين");
define("YOUR_POINT_UNTIL"," نقاطك حتى تصل إلى المستوى ");
define("OR_LOWER"," أو أقل!");
define("YOUR_HERO_HAS","بطلَك لديه ");
define("OF_HIT_POINTS"," من نقاط الحياة");
define("ERROR_NAME_SHORT","خطأ: الاسم قصير جدًا");
define("HEROSMANSION_DESC","في قصر البطل يمكنك تدريب بطلك الخاص، وعند المستويات 10، 15 و20 يمكنك غزو الواحات القريبة.");

define("GREATWAREHOUSE","المخزن الكبير");
define("GREATWAREHOUSE_DESC","يتم تخزين الأخشاب، الطين والحديد في المخزن الكبير. يوفر المخزن الكبير مساحة أكبر ويحافظ على الموارد أكثر جفافًا وأمانًا من المخزن العادي.");

define("GREATGRANARY","مخزن الحبوب الكبير");
define("GREATGRANARY_DESC","يتم تخزين القمح المنتج من مزارعك في مخزن الحبوب الكبير. يوفر مخزن الحبوب الكبير مساحة أكبر ويحافظ على القمح أكثر جفافًا وأمانًا من المخزن العادي.");

define("WONDER","عجيبة العالم");
define("WORLD_WONDER","عجيبة العالم");
define("WONDER_DESC","عجيبة العالم هي كما تبدو، رائعة للغاية. يتم بناء هذا المبنى للفوز بالخادم. يكلف كل مستوى من عجيبة العالم مئات الآلاف (أو حتى الملايين) من الموارد للبناء.");
define("WORLD_WONDER_CHANGE_NAME","تحتاج إلى عجيبة العالم المستوى 1 لتتمكن من تغيير اسمها.");
define("WORLD_WONDER_NAME","اسم عجيبة العالم");
define("WORLD_WONDER_NOTCHANGE_NAME","لا يمكنك تغيير اسم عجيبة العالم بعد المستوى 10.");
define("WORLD_WONDER_NAME_CHANGED","تم تغيير الاسم");

define("HORSEDRINKING","حوض شرب الخيول");
define("HORSEDRINKING_DESC","يقلل حوض شرب الخيول الخاص بالرومان من وقت تدريب الفرسان ومن استهلاكهم للقمح.");

define("GREATWORKSHOP","ورشة العمل الكبرى");
define("TRAINING_COMMENCE_GREATWORKSHOP","يمكن بدء التدريب عند اكتمال ورشة العمل الكبرى.");
define("GREATWORKSHOP_DESC","يمكن بناء آلات الحصار مثل المنجنيقات ومحطمات الأبواب في ورشة العمل الكبرى. كلما زاد مستواها، زادت سرعة إنتاج الوحدات.");

define("BUILDING_MAX_LEVEL_UNDER","المبنى قيد الإنشاء بأقصى مستوى");
define("BUILDING_BEING_DEMOLISHED","المبنى يتم هدمه حاليًا");
define("COSTS_UPGRADING_LEVEL","التكاليف</b> للترقية إلى المستوى");
define("WORKERS_ALREADY_WORK","العمال يعملون بالفعل.");
define("CONSTRUCTING_MASTER_BUILDER","البناء مع البنّاء الرئيسي ");
define("COSTS","التكاليف");
define("GOLD","الذهب");
define("WORKERS_ALREADY_WORK_WAITING","العمال يعملون بالفعل. (انتظار)");
define("ENOUGH_FOOD_EXPAND_CROPLAND","الطعام غير كافٍ. قم بتوسيع حقل القمح.");
define("UPGRADE_WAREHOUSE","ترقية المخزن");
define("UPGRADE_GRANARY","ترقية مخزن الحبوب");
define("YOUR_CROP_NEGATIVE","إنتاج القمح لديك سلبي، لن تحصل على الموارد المطلوبة.");
define("UPGRADE_LEVEL","الترقية إلى المستوى ");
define("WAITING","(انتظار)");
define("NEED_WWCONSTRUCTION_PLAN","تحتاج إلى خطة بناء عجيبة العالم");
define("NEED_MORE_WWCONSTRUCTION_PLAN","تحتاج إلى المزيد من خطط بناء عجيبة العالم");
define("CONSTRUCT_NEW_BUILDING","بناء مبنى جديد");
define("SHOWSOON_AVAILABLE_BUILDINGS","عرض المباني المتاحة قريبًا");
define("HIDESOON_AVAILABLE_BUILDINGS","إخفاء المباني المتاحة قريبًا");

//القطع الأثرية
define("ARCHITECTS_DESC","جميع المباني داخل نطاق التأثير تصبح أقوى. هذا يعني أنك ستحتاج إلى عدد أكبر من المنجنيقات لتدمير المباني المحمية بقوة هذه القطع الأثرية.");
define("ARCHITECTS_SMALL","سر المهندسين الصغير");
define("ARCHITECTS_SMALLVILLAGE","الإزميل الماسي");
define("ARCHITECTS_LARGE","سر المهندسين الكبير");
define("ARCHITECTS_LARGEVILLAGE","المطرقة الرخامية العملاقة");
define("ARCHITECTS_UNIQUE","سر المهندسين الفريد");
define("ARCHITECTS_UNIQUEVILLAGE","لفائف هيمنوس");
define("HASTE_DESC","تتحرك جميع القوات داخل نطاق التأثير بسرعة أكبر.");
define("HASTE_SMALL","أحذية التيتان الصغيرة");
define("HASTE_SMALLVILLAGE","حدوة الحصان العقيق");
define("HASTE_LARGE","أحذية التيتان الكبيرة");
define("HASTE_LARGEVILLAGE","العربة الذهبية");
define("HASTE_UNIQUE","أحذية التيتان الفريدة");
define("HASTE_UNIQUEVILLAGE","صنادل فيديبيدس");
define("EYESIGHT_DESC","تزداد قدرة الجواسيس (الكشافة، مكتشفو الطرق، وفرسان الكشافة) على التجسس. بالإضافة إلى ذلك، مع جميع إصدارات هذه القطعة الأثرية، يمكنك رؤية نوع القوات القادمة دون معرفة عددها.");
define("EYESIGHT_SMALL","عيون النسر الصغيرة");
define("EYESIGHT_SMALLVILLAGE","حكاية الجرذ");
define("EYESIGHT_LARGE","عيون النسر الكبيرة");
define("EYESIGHT_LARGEVILLAGE","رسالة الجنرال");
define("EYESIGHT_UNIQUE","عيون النسر الفريدة");
define("EYESIGHT_UNIQUEVILLAGE","مذكرات سون تزو");
define("DIET_DESC","تستهلك جميع القوات داخل نطاق القطعة الأثرية قمحًا أقل، مما يجعل من الممكن الحفاظ على جيش أكبر.");
define("DIET_SMALL","تحكم غذائي صغير");
define("DIET_SMALLVILLAGE","الصينية الفضية");
define("DIET_LARGE","تحكم غذائي كبير");
define("DIET_LARGEVILLAGE","القوس الصيد المقدس");
define("DIET_UNIQUE","التحكم الفريد في النظام الغذائي");
define("DIET_UNIQUEVILLAGE","كأس الملك آرثر");
define("ACADEMIC_DESC","يتم تدريب القوات بنسبة أسرع ضمن نطاق تأثير هذه القطعة الأثرية.");
define("ACADEMIC_SMALL","موهبة المدرب الصغيرة");
define("ACADEMIC_SMALLVILLAGE","قسم الجنود المكتوب");
define("ACADEMIC_LARGE","موهبة المدرب الكبيرة");
define("ACADEMIC_LARGEVILLAGE","إعلان الحرب");
define("ACADEMIC_UNIQUE","موهبة المدرب الفريدة");
define("ACADEMIC_UNIQUEVILLAGE","مذكرات الإسكندر الأكبر");
define("STORAGE_DESC","مع هذه الخطة يمكنك بناء المخزن الكبير أو مخزن الحبوب الكبير في القرية التي تحتوي على القطعة الأثرية، أو للحساب بأكمله حسب نوع القطعة الأثرية. طالما أنك تمتلك هذه القطعة، يمكنك بناء وتوسيع هذه المباني.");
define("STORAGE_SMALL","الخطة الصغيرة للتخزين");
define("STORAGE_SMALLVILLAGE","رسم البناة");
define("STORAGE_LARGE","الخطة الكبيرة للتخزين");
define("STORAGE_LARGEVILLAGE","لوح بابل");
define("CONFUSION_DESC","تزيد سعة المخبأ بمقدار معين لكل نوع من القطع الأثرية. يمكن للمنجنيقات ضرب أهداف عشوائية فقط في القرى ضمن نطاق تأثير هذه القطعة. الاستثناءات هي عجائب العالم وغرف الكنز التي يمكن استهدافها دائمًا، إلا مع القطعة الفريدة. عند التصويب على حقول الموارد، يتم ضرب الحقول العشوائية فقط، وعند التصويب على مبنى، يتم ضرب مبانٍ عشوائية فقط.");
define("CONFUSION_SMALL","ارتباك الخصوم الصغير");
define("CONFUSION_SMALLVILLAGE","خريطة الكهوف المخفية");
define("CONFUSION_LARGE","ارتباك الخصوم الكبير");
define("CONFUSION_LARGEVILLAGE","حقيبة بلا قاع");
define("CONFUSION_UNIQUE","ارتباك الخصوم الفريد");
define("CONFUSION_UNIQUEVILLAGE","حصان طروادة");
define("FOOL_DESC","كل 24 ساعة تحصل القطعة على تأثير عشوائي، مكافأة أو عقوبة (جميعها ممكنة باستثناء المخزن الكبير، مخزن الحبوب الكبير وخطط بناء عجائب العالم). يتغير التأثير والنطاق كل 24 ساعة. القطعة الفريدة تحصل دائمًا على مكافآت إيجابية.");
define("FOOL_SMALL","القطعة الأثرية للمخادع الصغير");
define("FOOL_SMALLVILLAGE","قلادة المشاغب");
define("FOOL_UNIQUE","القطعة الأثرية للمخادع الفريد");
define("FOOL_UNIQUEVILLAGE","المخطوطة المحرمة");
define("WWVILLAGE","قرية عجائب العالم");
define("ARTEFACT","<h1><b>قطع النتار الأثرية</b></h1>

تنتشر الشائعات بهمس بين القرى، وتروي أساطير لا يرويها سوى أفضل رواة القصص. تشير هذه الأساطير إلى النتار، المحارب الأكثر رعبًا في عالم ترافيان. قتلهم هو حلم أي بطل وهدف كل مقاتل. لا أحد يعلم كيف حصل النتار على هذه القوة الهائلة أو كيف أصبحت جيوشهم بهذه القسوة. مصممون على اكتشاف مصدر قوة النتار، أرسل المحاربون مجموعة من الجواسيس النخبة للتجسس عليهم. لم يمر وقت طويل حتى عاد الجواسيس بخوف يملأ عيونهم ونظريات رائعة: يبدو أن قوة النتار الطبيعية تأتي من أشياء غامضة يسمونها القطع الأثرية، والتي سرقوها من أسلافنا. حاول سرقة هذه القطع الأثرية، وستتمكن من السيطرة على قوتهم.

<img src=\"img/x.gif\" class=\"ArtifactsAnnouncement\">

حان الوقت للمطالبة بالقطع الأثرية. تعاون مع تحالفك وأرسل محاربيك للحصول على هذه القطع المطلوبة. ومع ذلك، لن يتخلى النتار عن القطع الأثرية بدون قتال ... وكذلك أعداؤك. إذا نجحت في استرداد القطع الأثرية وتمكنت من صد الأعداء، يمكنك جمع المكافآت. ستصبح مبانيك قوية للغاية، وستصبح قواتك أسرع وتستهلك كميات أقل من الطعام. استحوذ على القطع الأثرية، اجلب المجد لإمبراطوريتك، وكن أسطورة جديدة لأتباعك.

لسرقة قطعة أثرية، يجب أن تحدث الأمور التالية:

1. يجب أن تهاجم القرية (ليس غارة!)
2. تفوز بالهجوم
3. تدمر الخزانة
4. يجب أن تكون هناك خزانة فارغة بمستوى 10 للقطع الصغيرة ومستوًى 20 للقطع الكبيرة في القرية التي جاء منها الهجوم
5. يجب أن يكون لديك بطل في الهجوم

إذا لم يتحقق ذلك، فإن الهجوم التالي على تلك القرية، مع الفوز ببطل وخزانة فارغة، سيأخذ القطعة الأثرية.

لبناء عجائب العالم، يجب أن تمتلك خطة بنفسك (أنت = مالك قرية عجائب العالم) من المستوى 0 إلى 50. ومن المستوى 51 إلى 100 تحتاج إلى خطة إضافية في تحالفك! لن تعمل خطتان في حساب قرية عجائب العالم.

خطط البناء يمكن الاستحواذ عليها فور ظهورها في الخادم.

سيكون هناك عد تنازلي داخل اللعبة يعرض الوقت المحدد للإطلاق، قبل 5 أيام من الإطلاق. ");

//WW Village Release Message
define("WWVILLAGEMSG","<h1><b>قرى معجزة العالم</b></h1>

مرت أيام لا حصر لها منذ أولى المعارك على أسوار القرى الملعونة الخاصة بالنتار، حيث ناضلت العديد من الجيوش وماتت أمام أسوار القلاع التي حكم منها النتار العالم بأسره. الآن، مع استقرار الغبار وهدوء نسبي، بدأت الجيوش في حساب خسائرها وجمع موتاها، بينما تستعد أكبر الجيوش لتحضير الهجوم الأخير من أجل تحديد مصير العالم.

وصل الكشافة حاملين أخبارًا جديدة ومثيرة، حيث تم تحديد مواقع خطط البناء القديمة التي أخفتها جيوش النتار في حصون سرية شُيدت لتبقى مخفية عن أعين البشر. الآن تبدأ المرحلة الأخيرة، عندما تتصارع أعظم جيوش الشعوب الحرة مع جيوش النتار على مصير كل ما هو تحت السماء. هذه هي الحرب التي ستتردد أصداؤها عبر العصور، هذه هي حربك، وهنا ستكتب اسمك في التاريخ، وهنا ستصبح أسطورة.

<img src=\"img/x.gif\" class=\"WWVillagesAnnouncement\" title=\"".WWVILLAGE."\" alt=\"".WWVILLAGE."\">

للتمكن من غزو إحدى القرى، يجب أن تحدث الأمور التالية:

1. يجب أن تهاجم القرية (ليس غارة!)
2. تفوز بالهجوم
3. تدمر الإقامة
4. تخفض الولاء إلى 0 باستخدام: السيناتور، الزعيم، الرئيس
5. يجب أن تمتلك نقاط ثقافية كافية لغزو القرية

إذا لم تتحقق هذه الأمور، فإن الهجوم التالي على تلك القرية، مع الفوز والسيناتور أو الزعيم أو الرئيس، وخلو الإقامة/القصر من السكان، سيأخذ القرية.

لبناء عجائب العالم، يجب أن تمتلك خطة بناء بنفسك (أنت = مالك القرية التي تحتوي على عجائب العالم) من المستوى 0 إلى 50. ومن المستوى 51 إلى 100 تحتاج إلى خطة إضافية في تحالفك. لن تعمل خطتان في حساب قرية عجائب العالم.

خطط البناء يمكن الاستحواذ عليها فور ظهورها في الخادم.

سيكون هناك عد تنازلي داخل اللعبة يعرض الوقت المحدد للإطلاق، ".(5 / SPEED)." أيام قبل الإطلاق.");

//خطط البناء
define("PLAN","الخطة القديمة للبناء");
define("PLANVILLAGE","خطة بناء عجائب العالم");
define("PLAN_DESC","مع هذه الخطة القديمة للبناء يمكنك بناء عجائب العالم حتى المستوى 50. لبناء المزيد، يجب أن يمتلك تحالفك على الأقل خطتين.");
define("PLAN_INFO","<h1><b>خطط بناء عجائب العالم</b></h1>

منذ زمن بعيد، فوجئت قبائل ترافيان بعودة غير متوقعة للنتار. هذه القبيلة التي تفوقت على الجميع في الحكمة والقوة والمجد كانت على وشك أن تهدد الأحرار مرة أخرى. لذلك بذلوا كل جهودهم في التحضير لحرب أخيرة ضد النتار للتغلب عليهم إلى الأبد. اعتقد الكثيرون أن ما يُعرف بـ 'عجائب العالم'، وهي بناء مليء بالأساطير، هو الحل الوحيد. قيل إنها ستجعل أي شخص لا يقهر بمجرد اكتمالها، مما يجعل من يبنيها الحاكم والمسيطر على كل ما هو معروف في ترافيان.

ومع ذلك، قيل أيضًا إنه يجب امتلاك خطط بناء لتشييد مثل هذا البناء. لهذا السبب، ابتكر المهندسون المعماريون خططًا ذكية لتخزين هذه الخطط بأمان. بعد فترة، ظهرت مبانٍ تشبه المعابد في العديد من المدن الكبرى - غرف الكنز (الخزائن).

للأسف، لم يعرف أحد - حتى الحكماء وأصحاب المعرفة - مكان العثور على هذه الخطط. وكلما حاول الناس تحديد مكانها، بدا الأمر كما لو كانت مجرد أساطير.

اليوم، سيتم الكشف عن هذا السر الأخير. لم تذهب التضحيات والجهود الماضية عبثًا، حيث نجح الكشافة من عدة قبائل اليوم في تحديد أماكن خطط البناء. هذه الخطط، المحمية بشدة من قبل النتار، مخبأة في عدة واحات في جميع أنحاء ترافيان. فقط الأبطال الأكثر شجاعة سيتمكنون من تأمين مثل هذه الخطة وإعادتها إلى الوطن بأمان حتى تبدأ عملية البناء.

في النهاية، سنرى ما إذا كانت قبائل ترافيان الحرة يمكنها مرة أخرى التفوق على النتار والقضاء عليهم مرة واحدة وإلى الأبد. لكن لا تكن أحمقًا لتفترض أن النتار سيتركون الأمر بدون قتال!

<img src=\"img/x.gif\" class=\"WWBuildingPlansAnnouncement\" title=\"".PLAN."\" alt=\"".PLAN."\">

لسرقة مجموعة من خطط البناء من النتار، يجب أن تحدث الأمور التالية:
- يجب أن تهاجم القرية (ليس غارة!)
- يجب أن تفوز بالهجوم
- يجب أن تدمر غرفة الكنز (الخزينة)
- يجب أن يكون بطلك في ذلك الهجوم، لأنه الوحيد الذي يمكنه حمل خطط البناء
- يجب أن تكون هناك غرفة كنز فارغة بمستوى 10 في القرية التي جاء منها الهجوم
ملحوظة: إذا لم تتحقق المعايير المذكورة أعلاه أثناء الهجوم، فإن الهجوم التالي الذي يفي بالمعايير سيأخذ خطط البناء.

لبناء غرفة كنز (الخزينة)، ستحتاج إلى مبنى رئيسي بمستوى 10 ويجب ألا تحتوي القرية على عجائب العالم.

لبناء عجائب العالم، يجب أن تمتلك خطط البناء بنفسك (أنت = مالك قرية عجائب العالم) من المستوى 0 إلى 50، ومن المستوى 51 إلى 100 ستحتاج إلى مجموعة إضافية من خطط البناء في تحالفك! لن تعمل مجموعتان من خطط البناء في حساب قرية عجائب العالم!
");

//إعدادات المسؤول - Admin/Templates/config.tpl & editServerSet.tpl
define("EDIT_BACK","رجوع");
define("SERV_CONFIG","إعدادات الخادم");
define("SERV_SETT","إعدادات السيرفر");
define("EDIT_SERV_SETT","تعديل إعدادات السيرفر");
define("SERV_VARIABLE","المتغير");
define("SERV_VALUE","القيمة");
define("CONF_SERV_NAME","اسم السيرفر");
define("CONF_SERV_NAME_TOOLTIP","اسم سيرفر اللعبة.");
define("CONF_SERV_STARTED","بدء السيرفر");
define("CONF_SERV_STARTED_TOOLTIP","الوقت الذي بدأ فيه السيرفر. هذا المعامل لا يمكن تغييره على السيرفر المثبت.");
define("CONF_SERV_TIMEZONE","المنطقة الزمنية للسيرفر");
define("CONF_SERV_TIMEZONE_TOOLTIP","المنطقة الزمنية لسيرفر اللعبة.");
define("CONF_SERV_LANG","اللغة");
define("CONF_SERV_LANG_TOOLTIP","اللغة المستخدمة في لوحة التحكم الافتراضية وللجميع على سيرفر اللعبة.");
define("CONF_SERV_SERVSPEED","سرعة السيرفر");
define("CONF_SERV_SERVSPEED_TOOLTIP","سرعة السيرفر. كلما زادت سرعة السيرفر، زادت سرعة بناء المباني، وإجراء البحوث والتحسينات في الحداد، وبناء القوات بسرعة أكبر، وزادت إنتاجية الموارد.");
define("CONF_SERV_TROOPSPEED","سرعة القوات");
define("CONF_SERV_TROOPSPEED_TOOLTIP","سرعة حركة القوات على السيرفر. كلما زادت القيمة، زادت سرعة تحرك القوات عبر الخريطة.");
define("CONF_SERV_EVASIONSPEED","سرعة الهروب");
define("CONF_SERV_EVASIONSPEED_TOOLTIP","سرعة الهروب هي الوقت الذي تقضيه القوات في العودة إلى المنزل بعد هروبها من الهجوم.");
define("CONF_SERV_STORMULTIPLER","مضاعف السعة التخزينية");
define("CONF_SERV_STORMULTIPLER_TOOLTIP","مضاعف للسعة التخزينية للمخازن وصوامع الحبوب. القيمة 1 تعادل سعة 80,000 لكل مورد عند المستوى الأقصى. إذا تم ضبط القيمة على 2، فستكون السعة 160,000 لكل مورد.<br><b>ملاحظة:</b> كمية الموارد التي يتم إنشاؤها في الواحات غير المأهولة للنهب تعتمد على هذه القيمة.");
define("CONF_SERV_TRADCAPACITY","سعة التاجر");
define("CONF_SERV_TRADCAPACITY_TOOLTIP","مضاعف لسعة الموارد التي يمكن أن يحملها التاجر. القيمة 1 تساوي 500 للرومان، 750 للإغريق، 1000 للجرمان. إذا تم ضبط القيمة على 2، فستتضاعف السعة وفقًا لذلك.");
define("CONF_SERV_CRANCAPACITY","سعة المخبأ");
define("CONF_SERV_CRANCAPACITY_TOOLTIP","مضاعف لسعة المخبأ لحماية الموارد من النهب. القيمة 1 تعادل 1000 للرومان والجرمان، و2000 للإغريق.");
define("CONF_SERV_TRAPCAPACITY","سعة الفخاخ");
define("CONF_SERV_TRAPCAPACITY_TOOLTIP","مضاعف لسعة الفخاخ للإغريق لاحتجاز الجنود الأعداء قبل مهاجمة القرية.");
define("CONF_SERV_NATUNITSMULTIPLIER","مضاعف قوات النتار");
define("CONF_SERV_NATUNITSMULTIPLIER_TOOLTIP","هذا المعامل مسؤول عن عدد قوات النتار في القطع الأثرية وقرى عجائب العالم.");
define("CONF_SERV_NATARS_SPAWN_TIME","ظهور النتار");
define("CONF_SERV_NATARS_SPAWN_TIME_TOOLTIP","المدة التي تظهر بعدها النتار والقطع الأثرية من تاريخ بدء السيرفر، بالأيام.");
define("CONF_SERV_MAPSIZE","حجم الخريطة");
define("CONF_SERV_MAPSIZE_TOOLTIP","حجم خريطة العالم. لا يمكن تغييره بعد تثبيت السيرفر.");
define("CONF_SERV_BEGINPROTECT","حماية المبتدئين");
define("CONF_SERV_BEGINPROTECT_TOOLTIP","حماية تمنع مهاجمة القرى الجديدة لفترة زمنية محددة.");
define("CONF_SERV_REGOPEN","فتح التسجيل");
define("CONF_SERV_REGOPEN_TOOLTIP","تمكين (True) أو تعطيل (False) تسجيل اللاعبين على السيرفر.");
define("CONF_SERV_ACTIVMAIL","تفعيل البريد الإلكتروني");
define("CONF_SERV_ACTIVMAIL_TOOLTIP","إذا تم التمكين (Yes)، سيتطلب التسجيل تأكيد البريد الإلكتروني.");
define("CONF_SERV_QUEST","المهام");
define("CONF_SERV_QUEST_TOOLTIP","تمكين (Yes) أو تعطيل (No) المهام على السيرفر.");
define("CONF_SERV_GWORKSHOP","الورشة الكبيرة");
define("CONF_SERV_GWORKSHOP_TOOLTIP","تمكين (True) أو تعطيل (False) استخدام الورشة الكبيرة في اللعبة.");
define("CONF_SERV_ERRORREPORT","عرض تقارير الأخطاء");
define("CONF_SERV_ERRORREPORT_TOOLTIP","تمكين (Yes) أو تعطيل (No) عرض تقارير الأخطاء على السيرفر.");


//إعدادات PLUS - Admin/Templates/config.tpl & editPlusSet.tpl
define("PLUS_CONFIGURATION","<b><font color='#71D000'>P</font><font color='#FF6F0F'>l</font><font color='#71D000'>u</font><font color='#FF6F0F'>s</font></b> الإعدادات");
define("PLUS_SETT","<b><font color='#71D000'>P</font><font color='#FF6F0F'>l</font><font color='#71D000'>u</font><font color='#FF6F0F'>s</font></b> الإعدادات");
define("EDIT_PLUS_SETT","تعديل إعدادات <b><font color='#71D000'>P</font><font color='#FF6F0F'>l</font><font color='#71D000'>u</font><font color='#FF6F0F'>s</font></b>");
define("EDIT_PLUS_SETT1","تعديل إعدادات PLUS");
define("CONF_PLUS_PAYPALEMAIL","عنوان البريد الإلكتروني الخاص بـ <a href='https://www.paypal.com' target='_blank'>PayPal</a>");
define("CONF_PLUS_PAYPALEMAIL_TOOLTIP","عنوان البريد الإلكتروني المُسجل في PayPal.<br><font color='red'><b>يجب أن يكون حساب تجاري أو مميز!</b></font>");
define("CONF_PLUS_CURRENCY","عملة الدفع");
define("CONF_PLUS_CURRENCY_TOOLTIP","العملة التي سيتم استخدامها للدفع.");
define("CONF_PLUS_PACKAGEGOLDA","كمية الذهب للحزمة \"A\"");
define("CONF_PLUS_PACKAGEGOLDA_TOOLTIP","كمية الذهب التي يتم إصدارها عند دفع تكلفة الحزمة \"A\".");
define("CONF_PLUS_PACKAGEPRICEA","سعر الحزمة \"A\"");
define("CONF_PLUS_PACKAGEPRICEA_TOOLTIP","المبلغ المطلوب لدفع تكلفة الحزمة \"A\".");
define("CONF_PLUS_PACKAGEGOLDB","كمية الذهب للحزمة \"B\"");
define("CONF_PLUS_PACKAGEGOLDB_TOOLTIP","كمية الذهب التي يتم إصدارها عند دفع تكلفة الحزمة \"B\".");
define("CONF_PLUS_PACKAGEPRICEB","سعر الحزمة \"B\"");
define("CONF_PLUS_PACKAGEPRICEB_TOOLTIP","المبلغ المطلوب لدفع تكلفة الحزمة \"B\".");
define("CONF_PLUS_PACKAGEGOLDC","كمية الذهب للحزمة \"C\"");
define("CONF_PLUS_PACKAGEGOLDC_TOOLTIP","كمية الذهب التي يتم إصدارها عند دفع تكلفة الحزمة \"C\".");
define("CONF_PLUS_PACKAGEPRICEC","سعر الحزمة \"C\"");
define("CONF_PLUS_PACKAGEPRICEC_TOOLTIP","المبلغ المطلوب لدفع تكلفة الحزمة \"C\".");
define("CONF_PLUS_PACKAGEGOLDD","كمية الذهب للحزمة \"D\"");
define("CONF_PLUS_PACKAGEGOLDD_TOOLTIP","كمية الذهب التي يتم إصدارها عند دفع تكلفة الحزمة \"D\".");
define("CONF_PLUS_PACKAGEPRICED","سعر الحزمة \"D\"");
define("CONF_PLUS_PACKAGEPRICED_TOOLTIP","المبلغ المطلوب لدفع تكلفة الحزمة \"D\".");
define("CONF_PLUS_PACKAGEGOLDE","كمية الذهب للحزمة \"E\"");
define("CONF_PLUS_PACKAGEGOLDE_TOOLTIP","كمية الذهب التي يتم إصدارها عند دفع تكلفة الحزمة \"E\".");
define("CONF_PLUS_PACKAGEPRICEE","سعر الحزمة \"E\"");
define("CONF_PLUS_PACKAGEPRICEE_TOOLTIP","المبلغ المطلوب لدفع تكلفة الحزمة \"E\".");
define("CONF_PLUS_ACCDURATION","مدة حساب <b><font color='#71D000'>P</font><font color='#FF6F0F'>l</font><font color='#71D000'>u</font><font color='#FF6F0F'>s</font></b>");
define("CONF_PLUS_ACCDURATION_TOOLTIP","مدة وظيفة اللعبة <b><font color='#71D000'>P</font><font color='#FF6F0F'>l</font><font color='#71D000'>u</font><font color='#FF6F0F'>s</font></b> للحساب وقت التفعيل بواسطة اللاعب.");
define("CONF_PLUS_PRODUCTDURATION","مدة إنتاج +25%");
define("CONF_PLUS_PRODUCTDURATION_TOOLTIP","مدة وظيفة اللعبة إنتاج +25% للحساب وقت التفعيل بواسطة اللاعب.");

//إعدادات المسؤول - Admin/Templates/config.tpl & editLogSet.tpl
define("LOG_SETT","إعدادات السجل");
define("EDIT_LOG_SETT","تعديل إعدادات السجل");
define("CONF_LOG_BUILD","سجل البناء");
define("CONF_LOG_BUILD_TOOLTIP","تفعيل (نعم) أو تعطيل (لا) عرض سجلات إنشاء المباني في القرية.");
define("CONF_LOG_TECHNOLOGY","سجل التقنية");
define("CONF_LOG_TECHNOLOGY_TOOLTIP","تفعيل (نعم) أو تعطيل (لا) عرض سجلات تحسين القوات في الحداد والدروع.");
define("CONF_LOG_LOGIN","سجل تسجيل الدخول");
define("CONF_LOG_LOGIN_TOOLTIP","تفعيل (نعم) أو تعطيل (لا) عرض سجلات تسجيل دخول اللاعبين للعبة.");
define("CONF_LOG_GOLD","سجل الذهب");
define("CONF_LOG_GOLD_TOOLTIP","تفعيل (نعم) أو تعطيل (لا) عرض سجلات استخدام الذهب في اللعبة بواسطة اللاعبين.");
define("CONF_LOG_ADMIN","سجل المسؤول");
define("CONF_LOG_ADMIN_TOOLTIP","تفعيل (نعم) أو تعطيل (لا) عرض سجلات إجراءات المسؤول في لوحة التحكم.");
define("CONF_LOG_WAR","سجل الحرب");
define("CONF_LOG_WAR_TOOLTIP","تفعيل (نعم) أو تعطيل (لا) عرض سجلات الهجمات على اللاعبين في اللعبة.");
define("CONF_LOG_MARKET","سجل السوق");
define("CONF_LOG_MARKET_TOOLTIP","تفعيل (نعم) أو تعطيل (لا) عرض سجلات استخدام السوق في اللعبة بواسطة اللاعبين.");
define("CONF_LOG_ILLEGAL","سجل الأنشطة غير القانونية");
define("CONF_LOG_ILLEGAL_TOOLTIP","تفعيل (نعم) أو تعطيل (لا) عرض سجلات الأنشطة غير القانونية. (غير معروف بالضبط ما المقصود)");

//إعدادات Newsbox - Admin/Templates/config.tpl & editNewsboxSet.tpl
define("NEWSBOX_SETT","إعدادات Newsbox");
define("EDIT_NEWSBOX_SETT","تعديل إعدادات Newsbox");
define("EDIT_NEWSBOX1","Newsbox 1");
define("EDIT_NEWSBOX1_TOOLTIP","تفعيل أو تعطيل عرض Newsbox 1. يظهر في صفحة التفويض وصفحات اللعبة.");
define("EDIT_NEWSBOX2","Newsbox 2");
define("EDIT_NEWSBOX2_TOOLTIP","تفعيل أو تعطيل عرض Newsbox 2. يظهر في صفحة التفويض وصفحات اللعبة.");
define("EDIT_NEWSBOX3","Newsbox 3");
define("EDIT_NEWSBOX3_TOOLTIP","تفعيل أو تعطيل عرض Newsbox 3. يظهر في صفحة التفويض وصفحات اللعبة.");

//إعدادات SQL - Admin/Templates/config.tpl
define("SQL_SETTINGS","إعدادات SQL");
define("CONF_SQL_HOSTNAME","اسم المضيف");
define("CONF_SQL_HOSTNAME_TOOLTIP","اسم الخادم حيث يعمل MySQL (افتراضيًا: localhost).");
define("CONF_SQL_PORT","المنفذ");
define("CONF_SQL_PORT_TOOLTIP","منفذ MySQL للاتصال عن بُعد. المنفذ الافتراضي هو: 3306.");
define("CONF_SQL_DBUSER","اسم مستخدم قاعدة البيانات");
define("CONF_SQL_DBUSER_TOOLTIP","اسم المستخدم للاتصال بقاعدة البيانات.");
define("CONF_SQL_DBPASS","كلمة مرور قاعدة البيانات");
define("CONF_SQL_DBPASS_TOOLTIP","كلمة المرور الخاصة بالمستخدم للاتصال بقاعدة البيانات.");
define("CONF_SQL_DBNAME","اسم قاعدة البيانات");
define("CONF_SQL_DBNAME_TOOLTIP","اسم قاعدة البيانات التي يتم الاتصال بها.");
define("CONF_SQL_TBPREFIX","بادئة الجدول");
define("CONF_SQL_TBPREFIX_TOOLTIP","البادئة المستخدمة لجداول قاعدة البيانات.");
define("CONF_SQL_DBTYPE","نوع قاعدة البيانات");
define("CONF_SQL_DBTYPE_TOOLTIP","نوع قاعدة البيانات المستخدمة.");

//إعدادات إضافية - Admin/Templates/config.tpl & editExtraSet.tpl
define("EXTRA_SETT","إعدادات إضافية");
define("EDIT_EXTRA_SETT","تعديل الإعدادات الإضافية");
define("CONF_EXTRA_LIMITMAIL","حد البريد الوارد");
define("CONF_EXTRA_LIMITMAIL_TOOLTIP","تفعيل (نعم) أو تعطيل (لا) حد البريد الوارد.");
define("CONF_EXTRA_MAXMAIL","الحد الأقصى لعدد الرسائل");
define("CONF_EXTRA_MAXMAIL_TOOLTIP","الحد الأقصى لعدد الرسائل التي يمكن أن تتواجد في صندوق البريد.");

//معلومات المسؤول - Admin/Templates/config.tpl & editAdminInfo.tpl
define("ADMIN_INFO","معلومات المسؤول");
define("EDIT_ADMIN_INFO","تعديل معلومات المسؤول");
define("CONF_ADMIN_NAME","اسم المسؤول");
define("CONF_ADMIN_NAME_TOOLTIP","اسم حساب المسؤول.");
define("CONF_ADMIN_EMAIL","البريد الإلكتروني للمسؤول");
define("CONF_ADMIN_EMAIL_TOOLTIP","عنوان البريد الإلكتروني الخاص بحساب المسؤول.");
define("CONF_ADMIN_SHOWSTATS","إظهار المسؤول في الإحصائيات");
define("CONF_ADMIN_SHOWSTATS_TOOLTIP","تفعيل (True) أو تعطيل (False) عرض حساب المسؤول في الإحصائيات العامة للاعبين.");
define("CONF_ADMIN_SUPPMESS","تضمين رسائل الدعم");
define("CONF_ADMIN_SUPPMESS_TOOLTIP","تفعيل (True) أو تعطيل (False) إرسال الرسائل إلى صندوق بريد المسؤول المتعلقة بالدعم.");
define("CONF_ADMIN_RAIDATT","السماح بالهجوم على المسؤول");
define("CONF_ADMIN_RAIDATT_TOOLTIP","تفعيل (True) أو تعطيل (False) إمكانية الهجوم على المسؤول.");

/*
|--------------------------------------------------------------------------
|   Index
|--------------------------------------------------------------------------
*/

$lang['index'][0][1] = "مرحبًا بك في " . SERVER_NAME . "";
$lang['index'][0][2] = "الدليل";
$lang['index'][0][3] = "العب الآن، مجانًا!";
$lang['index'][0][4] = "ما هو " . SERVER_NAME . "";
$lang['index'][0][5] = "" . SERVER_NAME . " هي <b>لعبة متصفح</b> تقدم عالماً قديماً مليئاً بالتحدي مع آلاف اللاعبين الحقيقيين.</p><p>اللعبة <strong>مجانية تماماً</strong> ولا تتطلب <strong>أي تنزيلات</strong>.";
$lang['index'][0][6] = "اضغط هنا للعب " . SERVER_NAME . "";
$lang['index'][0][7] = "إجمالي اللاعبين";
$lang['index'][0][8] = "اللاعبين النشطين";
$lang['index'][0][9] = "اللاعبين المتصلين";
$lang['index'][0][10] = "حول اللعبة";
$lang['index'][0][11] = "ستبدأ كزعيم لقرية صغيرة وستشرع في مغامرة مثيرة.";
$lang['index'][0][12] = "قم ببناء القرى، شن الحروب أو إنشاء طرق تجارية مع جيرانك.";
$lang['index'][0][13] = "العب مع وضد آلاف اللاعبين الحقيقيين واحتل عالم Travian.";
$lang['index'][0][14] = "الأخبار";
$lang['index'][0][15] = "الأسئلة الشائعة";
$lang['index'][0][16] = "لقطات الشاشة";
$lang['forum'] = "المنتدى";
$lang['register'] = "التسجيل";
$lang['login'] = "تسجيل الدخول";
$lang['screenshots']['title1'] = "القرية";
$lang['screenshots']['desc1'] = "بناء القرية";
$lang['screenshots']['title2'] = "الموارد";
$lang['screenshots']['desc2'] = "موارد القرية هي الخشب، الطين، الحديد والمحاصيل";
$lang['screenshots']['title3'] = "الخريطة";
$lang['screenshots']['desc3'] = "موقع قريتك على الخريطة";
$lang['screenshots']['title4'] = "بناء المباني";
$lang['screenshots']['desc4'] = "كيفية بناء المباني أو رفع مستوى الموارد";
$lang['screenshots']['title5'] = "التقارير";
$lang['screenshots']['desc5'] = "تقرير هجومك";
$lang['screenshots']['title6'] = "الإحصائيات";
$lang['screenshots']['desc6'] = "عرض ترتيبك في الإحصائيات";
$lang['screenshots']['title7'] = "الأسلحة أم الاقتصاد";
$lang['screenshots']['desc7'] = "يمكنك اختيار اللعب كقوة عسكرية أو اقتصادية";


?>
